address_data = [{
"name": "北京", //一级选项 字符串
"sub": [ //JSON数组
	{
		"name": "东城" //二级选项 字符串

	}, {
		"name": "西城" //二级选项 字符串
	}, {
		"name": "朝阳" //二级选项 字符串
	}, {
		"name": "丰台" //二级选项 字符串
	}, {
		"name": "石景山" //二级选项 字符串
	}, {
		"name": "海淀" //二级选项 字符串
	}, {
		"name": "门头沟" //二级选项 字符串
	}, {
		"name": "房山" //二级选项 字符串
	}, {
		"name": "通州" //二级选项 字符串
	}, {
		"name": "顺义" //二级选项 字符串
	}, {
		"name": "昌平" //二级选项 字符串
	}, {
		"name": "大兴" //二级选项 字符串
	}, {
		"name": "平谷" //二级选项 字符串
	}, {
		"name": "怀柔" //二级选项 字符串
	}, {
		"name": "密云" //二级选项 字符串
	}, {
		"name": "延庆" //二级选项 字符串
	},
]
}, {
"name": "天津", //一级选项 字符串
"sub": [ //JSON数组
	{
		"name": "和平" //二级选项 字符串
	}, {
		"name": "河东" //二级选项 字符串
	}, {
		"name": "河西" //二级选项 字符串
	}, {
		"name": "南开" //二级选项 字符串
	}, {
		"name": "河北" //二级选项 字符串
	}, {
		"name": "红桥" //二级选项 字符串
	}, {
		"name": "滨海新区" //二级选项 字符串
	}, {
		"name": "东丽" //二级选项 字符串
	}, {
		"name": "西青" //二级选项 字符串
	}, {
		"name": "津南" //二级选项 字符串
	}, {
		"name": "北辰" //二级选项 字符串
	}, {
		"name": "宁河" //二级选项 字符串
	}, {
		"name": "武清" //二级选项 字符串
	}, {
		"name": "静海" //二级选项 字符串
	}, {
		"name": "宝坁" //二级选项 字符串
	}, {
		"name": "蓟县" //二级选项 字符串
	},
]
}, {
"name": "上海市", //一级选项 字符串
"sub": [ //JSON数组
	{
		"name": "黄浦" //二级选项 字符串
	}, {
		"name": "卢湾" //二级选项 字符串
	}, {
		"name": "徐汇" //二级选项 字符串
	}, {
		"name": "长宁" //二级选项 字符串
	}, {
		"name": "静安" //二级选项 字符串
	}, {
		"name": "普陀" //二级选项 字符串
	}, {
		"name": "闸北" //二级选项 字符串
	}, {
		"name": "虹口" //二级选项 字符串
	}, {
		"name": "杨浦" //二级选项 字符串
	}, {
		"name": "闵行" //二级选项 字符串
	}, {
		"name": "宝山" //二级选项 字符串
	}, {
		"name": "嘉定" //二级选项 字符串
	}, {
		"name": "浦东新区" //二级选项 字符串
	}, {
		"name": "金山" //二级选项 字符串
	}, {
		"name": "松江" //二级选项 字符串
	}, {
		"name": "奉贤" //二级选项 字符串
	}, {
		"name": "青浦" //二级选项 字符串
	}, {
		"name": "崇明" //二级选项 字符串
	}
]
}, {
"name": "重庆市", //一级选项 字符串
"sub": [ //JSON数组
	{
		"name": "万州" //二级选项 字符串
	}, {
		"name": "涪陵" //二级选项 字符串
	}, {
		"name": "渝中" //二级选项 字符串
	}, {
		"name": "大渡口" //二级选项 字符串
	}, {
		"name": "江北" //二级选项 字符串
	}, {
		"name": "沙坪坝" //二级选项 字符串
	}, {
		"name": "九龙坡" //二级选项 字符串
	}, {
		"name": "南岸" //二级选项 字符串
	}, {
		"name": "北碚" //二级选项 字符串
	}, {
		"name": "两江新区" //二级选项 字符串
	}, {
		"name": "万盛" //二级选项 字符串
	}, {
		"name": "双桥" //二级选项 字符串
	}, {
		"name": "渝北" //二级选项 字符串
	}, {
		"name": "巴南" //二级选项 字符串
	}, {
		"name": "长寿" //二级选项 字符串
	}, {
		"name": "綦江" //二级选项 字符串
	}, {
		"name": "潼南" //二级选项 字符串
	}, {
		"name": "铜梁" //二级选项 字符串
	}, {
		"name": "大足" //二级选项 字符串
	}, {
		"name": "荣昌" //二级选项 字符串
	}, {
		"name": "璧山" //二级选项 字符串
	}, {
		"name": "梁平" //二级选项 字符串
	}, {
		"name": "城口" //二级选项 字符串
	}, {
		"name": "丰都" //二级选项 字符串
	}, {
		"name": "垫江" //二级选项 字符串
	}, {
		"name": "武隆" //二级选项 字符串
	}, {
		"name": "忠县" //二级选项 字符串
	}, {
		"name": "开县" //二级选项 字符串
	}, {
		"name": "云阳" //二级选项 字符串
	}, {
		"name": "奉节" //二级选项 字符串
	}, {
		"name": "巫山" //二级选项 字符串
	}, {
		"name": "巫溪" //二级选项 字符串
	}, {
		"name": "黔江" //二级选项 字符串
	}, {
		"name": "石柱" //二级选项 字符串
	}, {
		"name": "秀山" //二级选项 字符串
	}, {
		"name": "酉阳" //二级选项 字符串
	}, {
		"name": "彭水" //二级选项 字符串
	}, {
		"name": "江津" //二级选项 字符串
	}, {
		"name": "合川" //二级选项 字符串
	}, {
		"name": "永川" //二级选项 字符串
	}, {
		"name": "南川" //二级选项 字符串
	}
]
}, {
"name": "河北省", //一级选项 字符串
"sub": [ //JSON数组
	{
		"name": "石家庄", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "长安区" //三级选项 字符串
			}, {
				"name": "桥东区" //三级选项 字符串
			}, {
				"name": "桥西区" //三级选项 字符串
			}, {
				"name": "新华区" //三级选项 字符串
			}, {
				"name": "井陉矿区" //三级选项 字符串
			}, {
				"name": "裕华区" //三级选项 字符串
			}, {
				"name": "井陉县" //三级选项 字符串
			}, {
				"name": "正定县" //三级选项 字符串
			}, {
				"name": "栾城县" //三级选项 字符串
			}, {
				"name": "行唐县" //三级选项 字符串
			}, {
				"name": "灵寿县" //三级选项 字符串
			}, {
				"name": "高邑县" //三级选项 字符串
			}, {
				"name": "深泽县" //三级选项 字符串
			}, {
				"name": "赞皇县" //三级选项 字符串
			}, {
				"name": "无极县" //三级选项 字符串
			}, {
				"name": "平山县" //三级选项 字符串
			}, {
				"name": "元氏县" //三级选项 字符串
			}, {
				"name": "赵县" //三级选项 字符串
			}, {
				"name": "辛集市" //三级选项 字符串
			}, {
				"name": "藁城市" //三级选项 字符串
			}, {
				"name": "晋州市" //三级选项 字符串
			}, {
				"name": "新乐市" //三级选项 字符串
			}, {
				"name": "鹿泉市" //三级选项 字符串
			},

		]
	}, {
		"name": "唐山", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "路南区" //三级选项 字符串
			}, {
				"name": "路北区" //三级选项 字符串
			}, {
				"name": "古治区" //三级选项 字符串
			}, {
				"name": "开平区" //三级选项 字符串
			}, {
				"name": "丰南区" //三级选项 字符串
			}, {
				"name": "丰润区" //三级选项 字符串
			}, {
				"name": "曹妃甸区" //三级选项 字符串
			}, {
				"name": "滦县" //三级选项 字符串
			}, {
				"name": "滦南县" //三级选项 字符串
			}, {
				"name": "乐亭县" //三级选项 字符串
			}, {
				"name": "迁西县" //三级选项 字符串
			}, {
				"name": "玉田县" //三级选项 字符串
			}, {
				"name": "遵化县" //三级选项 字符串
			}, {
				"name": "迁安市" //三级选项 字符串
			},

		]
	}, {
		"name": "秦皇岛", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "海港区" //三级选项 字符串
			}, {
				"name": "山海关区" //三级选项 字符串
			}, {
				"name": "北戴河区" //三级选项 字符串
			}, {
				"name": "青龙满族自治县" //三级选项 字符串
			}, {
				"name": "昌黎县" //三级选项 字符串
			}, {
				"name": "抚宁县" //三级选项 字符串
			}, {
				"name": "卢龙县" //三级选项 字符串
			},

		]
	}, {
		"name": "邯郸", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "邯山区" //三级选项 字符串
			}, {
				"name": "丛台区" //三级选项 字符串
			}, {
				"name": "复兴区" //三级选项 字符串
			}, {
				"name": "峰峰矿区" //三级选项 字符串
			}, {
				"name": "邯郸县" //三级选项 字符串
			}, {
				"name": "临漳县" //三级选项 字符串
			}, {
				"name": "成安县" //三级选项 字符串
			}, {
				"name": "大名县" //三级选项 字符串
			}, {
				"name": "涉县" //三级选项 字符串
			}, {
				"name": "磁县" //三级选项 字符串
			}, {
				"name": "肥乡县" //三级选项 字符串
			}, {
				"name": "永年县" //三级选项 字符串
			}, {
				"name": "邱县" //三级选项 字符串
			}, {
				"name": "鸡泽县" //三级选项 字符串
			}, {
				"name": "广平县" //三级选项 字符串
			}, {
				"name": "馆陶县" //三级选项 字符串
			}, {
				"name": "魏县" //三级选项 字符串
			}, {
				"name": "曲周县" //三级选项 字符串
			}, {
				"name": "武安市" //三级选项 字符串
			},

		]
	}, {
		"name": "邢台", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "桥东区" //三级选项 字符串
			}, {
				"name": "桥西区" //三级选项 字符串
			}, {
				"name": "邢台县" //三级选项 字符串
			}, {
				"name": "临城县" //三级选项 字符串
			}, {
				"name": "内丘县" //三级选项 字符串
			}, {
				"name": "柏乡县" //三级选项 字符串
			}, {
				"name": "隆尧县" //三级选项 字符串
			}, {
				"name": "任县" //三级选项 字符串
			}, {
				"name": "南和县" //三级选项 字符串
			}, {
				"name": "宁晋县" //三级选项 字符串
			}, {
				"name": "巨鹿县" //三级选项 字符串
			}, {
				"name": "新河县" //三级选项 字符串
			}, {
				"name": "广宗县" //三级选项 字符串
			}, {
				"name": "平乡县" //三级选项 字符串
			}, {
				"name": "威县" //三级选项 字符串
			}, {
				"name": "清河县" //三级选项 字符串
			}, {
				"name": "临西县" //三级选项 字符串
			}, {
				"name": "南宫市" //三级选项 字符串
			}, {
				"name": "沙河市" //三级选项 字符串
			},

		]
	}, {
		"name": "保定", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "新市区" //三级选项 字符串
			}, {
				"name": "北市区" //三级选项 字符串
			}, {
				"name": "南市区" //三级选项 字符串
			}, {
				"name": "满城县" //三级选项 字符串
			}, {
				"name": "清苑县" //三级选项 字符串
			}, {
				"name": "涞水县" //三级选项 字符串
			}, {
				"name": "阜平县" //三级选项 字符串
			}, {
				"name": "徐水县" //三级选项 字符串
			}, {
				"name": "定兴县" //三级选项 字符串
			}, {
				"name": "唐县" //三级选项 字符串
			}, {
				"name": "高阳县" //三级选项 字符串
			}, {
				"name": "容城县" //三级选项 字符串
			}, {
				"name": "涞源县" //三级选项 字符串
			}, {
				"name": "望都县" //三级选项 字符串
			}, {
				"name": "安新县" //三级选项 字符串
			}, {
				"name": "易县" //三级选项 字符串
			}, {
				"name": "曲阳县" //三级选项 字符串
			}, {
				"name": "蠡县" //三级选项 字符串
			}, {
				"name": "顺平县" //三级选项 字符串
			}, {
				"name": "博野县" //三级选项 字符串
			}, {
				"name": "雄县" //三级选项 字符串
			}, {
				"name": "涿州市" //三级选项 字符串
			}, {
				"name": "定州市" //三级选项 字符串
			}, {
				"name": "安国市" //三级选项 字符串
			}, {
				"name": "高碑店市" //三级选项 字符串
			},
		]
	}, {
		"name": "张家口", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "桥东区" //三级选项 字符串
			}, {
				"name": "桥西区" //三级选项 字符串
			}, {
				"name": "宣化区" //三级选项 字符串
			}, {
				"name": "下花园区" //三级选项 字符串
			}, {
				"name": "宣化县" //三级选项 字符串
			}, {
				"name": "张北县" //三级选项 字符串
			}, {
				"name": "康保县" //三级选项 字符串
			}, {
				"name": "沽源县" //三级选项 字符串
			}, {
				"name": "尚义县" //三级选项 字符串
			}, {
				"name": "蔚县" //三级选项 字符串
			}, {
				"name": "怀安县" //三级选项 字符串
			}, {
				"name": "万全县" //三级选项 字符串
			}, {
				"name": "怀来县" //三级选项 字符串
			}, {
				"name": "涿鹿县" //三级选项 字符串
			}, {
				"name": "赤城县" //三级选项 字符串
			}, {
				"name": "崇礼县" //三级选项 字符串
			},

		]
	},

	{
		"name": "承德", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "双桥区" //三级选项 字符串
			}, {
				"name": "双滦区" //三级选项 字符串
			}, {
				"name": "鹰手营子矿区" //三级选项 字符串
			}, {
				"name": "承德县" //三级选项 字符串
			}, {
				"name": "兴隆县" //三级选项 字符串
			}, {
				"name": "平泉县" //三级选项 字符串
			}, {
				"name": "滦平县" //三级选项 字符串
			}, {
				"name": "隆化县" //三级选项 字符串
			}, {
				"name": "丰宁满族自治县" //三级选项 字符串
			}, {
				"name": "宽城满族自治县" //三级选项 字符串
			}, {
				"name": "围场满族蒙古族自治县" //三级选项 字符串
			}
		]
	}, {
		"name": "沧州", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "新华区" //三级选项 字符串
			}, {
				"name": "运河区" //三级选项 字符串
			}, {
				"name": "沧县" //三级选项 字符串
			}, {
				"name": "青县" //三级选项 字符串
			}, {
				"name": "东光县" //三级选项 字符串
			}, {
				"name": "海兴县" //三级选项 字符串
			}, {
				"name": "盐山县" //三级选项 字符串
			}, {
				"name": "肃宁县" //三级选项 字符串
			}, {
				"name": "南皮县" //三级选项 字符串
			}, {
				"name": "吴桥县" //三级选项 字符串
			}, {
				"name": "献县" //三级选项 字符串
			}, {
				"name": "孟村回族自治县" //三级选项 字符串
			}, {
				"name": "泊头市" //三级选项 字符串
			}, {
				"name": "任丘市" //三级选项 字符串
			}, {
				"name": "黄骅市" //三级选项 字符串
			}, {
				"name": "河间市" //三级选项 字符串
			},

		]
	}, {
		"name": "廊坊", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "安次区" //三级选项 字符串
			}, {
				"name": "广阳区" //三级选项 字符串
			}, {
				"name": "固安县" //三级选项 字符串
			}, {
				"name": "永清县" //三级选项 字符串
			}, {
				"name": "香河县" //三级选项 字符串
			}, {
				"name": "大城县" //三级选项 字符串
			}, {
				"name": "文安县" //三级选项 字符串
			}, {
				"name": "大厂回族自治县" //三级选项 字符串
			}, {
				"name": "霸州市" //三级选项 字符串
			}, {
				"name": "三河市" //三级选项 字符串
			},

		]
	}, {
		"name": "衡水", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "桃城区" //三级选项 字符串
			}, {
				"name": "枣强县" //三级选项 字符串
			}, {
				"name": "武邑县" //三级选项 字符串
			}, {
				"name": "武强县" //三级选项 字符串
			}, {
				"name": "饶阳县" //三级选项 字符串
			}, {
				"name": "安平县" //三级选项 字符串
			}, {
				"name": "故城县" //三级选项 字符串
			}, {
				"name": "景县" //三级选项 字符串
			}, {
				"name": "阜城县" //三级选项 字符串
			}, {
				"name": "冀州市" //三级选项 字符串
			}, {
				"name": "深州市" //三级选项 字符串
			},
		]
	},
]
}, {
"name": "山西省", //一级选项 字符串
"sub": [ //JSON数组
	{
		"name": "太原", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "小店区" //三级选项 字符串
			}, {
				"name": "迎泽区" //三级选项 字符串
			}, {
				"name": "杏花岭区" //三级选项 字符串
			}, {
				"name": "尖草坪区" //三级选项 字符串
			}, {
				"name": "万柏林区" //三级选项 字符串
			}, {
				"name": "晋源区" //三级选项 字符串
			}, {
				"name": "清徐县" //三级选项 字符串
			}, {
				"name": "阳曲县" //三级选项 字符串
			}, {
				"name": "娄烦县" //三级选项 字符串
			}, {
				"name": "古交市" //三级选项 字符串
			},
		]
	}, {
		"name": "大同", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "城区" //三级选项 字符串
			}, {
				"name": "矿区" //三级选项 字符串
			}, {
				"name": "南郊区" //三级选项 字符串
			}, {
				"name": "新荣区" //三级选项 字符串
			}, {
				"name": "阳高县" //三级选项 字符串
			}, {
				"name": "天镇县" //三级选项 字符串
			}, {
				"name": "广灵县" //三级选项 字符串
			}, {
				"name": "灵丘县" //三级选项 字符串
			}, {
				"name": "浑源县" //三级选项 字符串
			}, {
				"name": "大同县" //三级选项 字符串
			},
		]
	}, {
		"name": "阳泉", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "城区" //三级选项 字符串
			}, {
				"name": "矿区" //三级选项 字符串
			}, {
				"name": "郊区" //三级选项 字符串
			}, {
				"name": "平定县" //三级选项 字符串
			}, {
				"name": "盂县" //三级选项 字符串
			},
		]
	}, {
		"name": "长治", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "城区" //三级选项 字符串
			}, {
				"name": "郊区" //三级选项 字符串
			}, {
				"name": "长治县" //三级选项 字符串
			}, {
				"name": "襄垣县" //三级选项 字符串
			}, {
				"name": "屯留县" //三级选项 字符串
			}, {
				"name": "平顺县" //三级选项 字符串
			}, {
				"name": "黎城县" //三级选项 字符串
			}, {
				"name": "壶关县" //三级选项 字符串
			}, {
				"name": "长子县" //三级选项 字符串
			}, {
				"name": "武乡县" //三级选项 字符串
			}, {
				"name": "沁县" //三级选项 字符串
			}, {
				"name": "沁源县" //三级选项 字符串
			}, {
				"name": "潞城市" //三级选项 字符串
			},

		]
	}, {
		"name": "晋城", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "城区" //三级选项 字符串
			}, {
				"name": "沁水县" //三级选项 字符串
			}, {
				"name": "阳城县" //三级选项 字符串
			}, {
				"name": "陵川县" //三级选项 字符串
			}, {
				"name": "泽州县" //三级选项 字符串
			},

		]
	}, {
		"name": "朔州", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "朔城区" //三级选项 字符串
			}, {
				"name": "平鲁区" //三级选项 字符串
			}, {
				"name": "山阴县" //三级选项 字符串
			}, {
				"name": "应县" //三级选项 字符串
			}, {
				"name": "右玉县" //三级选项 字符串
			}, {
				"name": "怀仁县" //三级选项 字符串
			},

		]
	}, {
		"name": "晋中", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "榆次区" //三级选项 字符串
			}, {
				"name": "榆社县" //三级选项 字符串
			}, {
				"name": "左权县" //三级选项 字符串
			}, {
				"name": "和顺县" //三级选项 字符串
			}, {
				"name": "昔阳县" //三级选项 字符串
			}, {
				"name": "寿阳县" //三级选项 字符串
			}, {
				"name": "太谷县" //三级选项 字符串
			}, {
				"name": "祁县" //三级选项 字符串
			}, {
				"name": "平遥县" //三级选项 字符串
			}, {
				"name": "灵石县" //三级选项 字符串
			}, {
				"name": "介休市" //三级选项 字符串
			},

		]
	}, {
		"name": "运城", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "盐湖区" //三级选项 字符串
			}, {
				"name": "临猗县" //三级选项 字符串
			}, {
				"name": "万荣县" //三级选项 字符串
			}, {
				"name": "闻喜县" //三级选项 字符串
			}, {
				"name": "稷山县" //三级选项 字符串
			}, {
				"name": "新绛县" //三级选项 字符串
			}, {
				"name": "绛县" //三级选项 字符串
			}, {
				"name": "垣曲县" //三级选项 字符串
			}, {
				"name": "夏县" //三级选项 字符串
			}, {
				"name": "平陆县" //三级选项 字符串
			}, {
				"name": "苪城县" //三级选项 字符串
			}, {
				"name": "永济市" //三级选项 字符串
			}, {
				"name": "河津市" //三级选项 字符串
			},

		]
	}, {
		"name": "忻州", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "忻府区" //三级选项 字符串
			}, {
				"name": "定襄县" //三级选项 字符串
			}, {
				"name": "五台县" //三级选项 字符串
			}, {
				"name": "代县" //三级选项 字符串
			}, {
				"name": "繁峙县" //三级选项 字符串
			}, {
				"name": "宁武县" //三级选项 字符串
			}, {
				"name": "静乐县" //三级选项 字符串
			}, {
				"name": "神池县" //三级选项 字符串
			}, {
				"name": "五寨县" //三级选项 字符串
			}, {
				"name": "岢岚县" //三级选项 字符串
			}, {
				"name": "河曲县" //三级选项 字符串
			}, {
				"name": "保德县" //三级选项 字符串
			}, {
				"name": "偏关县" //三级选项 字符串
			}, {
				"name": "原平市" //三级选项 字符串
			},
		]
	}, {
		"name": "临汾", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "尧都区" //三级选项 字符串
			}, {
				"name": "曲沃县" //三级选项 字符串
			}, {
				"name": "翼城县" //三级选项 字符串
			}, {
				"name": "襄汾县" //三级选项 字符串
			}, {
				"name": "洪洞县" //三级选项 字符串
			}, {
				"name": "古县" //三级选项 字符串
			}, {
				"name": "安泽县" //三级选项 字符串
			}, {
				"name": "浮山县" //三级选项 字符串
			}, {
				"name": "吉县" //三级选项 字符串
			}, {
				"name": "乡宁县" //三级选项 字符串
			}, {
				"name": "大宁县" //三级选项 字符串
			}, {
				"name": "隰县" //三级选项 字符串
			}, {
				"name": "永和县" //三级选项 字符串
			}, {
				"name": "蒲县" //三级选项 字符串
			}, {
				"name": "汾西县" //三级选项 字符串
			}, {
				"name": "侯马县" //三级选项 字符串
			}, {
				"name": "霍州市" //三级选项 字符串
			},

		]
	}, {
		"name": "吕梁", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "离石区" //三级选项 字符串
			}, {
				"name": "文水县" //三级选项 字符串
			}, {
				"name": "交城县" //三级选项 字符串
			}, {
				"name": "兴县" //三级选项 字符串
			}, {
				"name": "临县" //三级选项 字符串
			}, {
				"name": "柳林县" //三级选项 字符串
			}, {
				"name": "石楼县" //三级选项 字符串
			}, {
				"name": "岚县" //三级选项 字符串
			}, {
				"name": "方山县" //三级选项 字符串
			}, {
				"name": "中阳县" //三级选项 字符串
			}, {
				"name": "交口县" //三级选项 字符串
			}, {
				"name": "孝义市" //三级选项 字符串
			}, {
				"name": "汾阳县" //三级选项 字符串
			},

		]
	},

]
},{
"name": "辽宁省", //一级选项 字符串
"sub": [ //JSON数组
	{
		"name": "沈阳", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "和平区" //三级选项 字符串
			}, {
				"name": "沈河区" //三级选项 字符串
			}, {
				"name": "大东区" //三级选项 字符串
			}, {
				"name": "皇姑区" //三级选项 字符串
			}, {
				"name": "铁西区" //三级选项 字符串
			}, {
				"name": "苏家屯区" //三级选项 字符串
			}, {
				"name": "东陵区" //三级选项 字符串
			}, {
				"name": "沈北新区" //三级选项 字符串
			}, {
				"name": "于洪区" //三级选项 字符串
			}, {
				"name": "辽中区" //三级选项 字符串
			}, {
				"name": "康平县" //三级选项 字符串
			}, {
				"name": "法库县" //三级选项 字符串
			}, {
				"name": "新民市" //三级选项 字符串
			},
		]
	}, {
		"name": "大连", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "中山区" //三级选项 字符串
			}, {
				"name": "西岗区" //三级选项 字符串
			}, {
				"name": "沙河口区" //三级选项 字符串
			}, {
				"name": "甘井子区" //三级选项 字符串
			}, {
				"name": "旅顺口区" //三级选项 字符串
			}, {
				"name": "金州区" //三级选项 字符串
			}, {
				"name": "长海县" //三级选项 字符串
			}, {
				"name": "瓦房店市" //三级选项 字符串
			}, {
				"name": "普兰店市" //三级选项 字符串
			}, {
				"name": "庄河市" //三级选项 字符串
			},
		]
	}, {
		"name": "鞍山", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "铁东区" //三级选项 字符串
			}, {
				"name": "铁西区" //三级选项 字符串
			}, {
				"name": "立山区" //三级选项 字符串
			}, {
				"name": "千山区" //三级选项 字符串
			}, {
				"name": "台安县" //三级选项 字符串
			}, {
				"name": "岫岩满族自治县" //三级选项 字符串
			}, {
				"name": "海城市" //三级选项 字符串
			},
		]
	}, {
		"name": "抚顺", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "新抚区" //三级选项 字符串
			}, {
				"name": "东洲区" //三级选项 字符串
			}, {
				"name": "望花区" //三级选项 字符串
			}, {
				"name": "顺城区" //三级选项 字符串
			}, {
				"name": "抚顺县" //三级选项 字符串
			}, {
				"name": "新宾满族自治县" //三级选项 字符串
			}, {
				"name": "清原满族自治县" //三级选项 字符串
			},
		]
	}, {
		"name": "本溪", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "平山区" //三级选项 字符串
			}, {
				"name": "溪湖区" //三级选项 字符串
			}, {
				"name": "明山区" //三级选项 字符串
			}, {
				"name": "南芬区" //三级选项 字符串
			}, {
				"name": "本溪满族自治县" //三级选项 字符串
			}, {
				"name": "桓仁满族自治县" //三级选项 字符串
			},
		]
	}, {
		"name": "丹东", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "元宝区" //三级选项 字符串
			}, {
				"name": "振兴区" //三级选项 字符串
			}, {
				"name": "振安区" //三级选项 字符串
			}, {
				"name": "宽甸满族自治县" //三级选项 字符串
			}, {
				"name": "东港市" //三级选项 字符串
			}, {
				"name": "凤城市" //三级选项 字符串
			},
		]
	}, {
		"name": "锦州", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "古塔区" //三级选项 字符串
			}, {
				"name": "凌河区" //三级选项 字符串
			}, {
				"name": "太和区" //三级选项 字符串
			}, {
				"name": "黑山县" //三级选项 字符串
			}, {
				"name": "义县" //三级选项 字符串
			}, {
				"name": "凌海市" //三级选项 字符串
			}, {
				"name": "北镇市" //三级选项 字符串
			},

		]
	}, {
		"name": "营口", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "站前区" //三级选项 字符串
			}, {
				"name": "西市区" //三级选项 字符串
			}, {
				"name": "鲅鱼圈区" //三级选项 字符串
			}, {
				"name": "老边区" //三级选项 字符串
			}, {
				"name": "盖州市" //三级选项 字符串
			}, {
				"name": "大石桥市" //三级选项 字符串
			},
		]
	}, {
		"name": "阜新", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "海州区" //三级选项 字符串
			}, {
				"name": "新邱区" //三级选项 字符串
			}, {
				"name": "太平区" //三级选项 字符串
			}, {
				"name": "清河门区" //三级选项 字符串
			}, {
				"name": "细河区" //三级选项 字符串
			}, {
				"name": "阜新蒙古族自治县" //三级选项 字符串
			}, {
				"name": "彰武县" //三级选项 字符串
			},
		]
	}, {
		"name": "辽阳", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "白塔区" //三级选项 字符串
			}, {
				"name": "文圣区" //三级选项 字符串
			}, {
				"name": "宏伟区" //三级选项 字符串
			}, {
				"name": "弓长岭区" //三级选项 字符串
			}, {
				"name": "太子河区" //三级选项 字符串
			}, {
				"name": "辽阳县" //三级选项 字符串
			}, {
				"name": "灯塔市" //三级选项 字符串
			},
		]
	}, {
		"name": "盘锦", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "双台子区" //三级选项 字符串
			}, {
				"name": "兴隆台区" //三级选项 字符串
			}, {
				"name": "大洼县" //三级选项 字符串
			}, {
				"name": "盘山县" //三级选项 字符串
			},
		]
	}, {
		"name": "铁岭", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "银州区" //三级选项 字符串
			}, {
				"name": "清河区" //三级选项 字符串
			}, {
				"name": "铁岭县" //三级选项 字符串
			}, {
				"name": "西丰县" //三级选项 字符串
			}, {
				"name": "昌图县" //三级选项 字符串
			}, {
				"name": "调兵山市" //三级选项 字符串
			}, {
				"name": "开原市" //三级选项 字符串
			},
		]
	}, {
		"name": "朝阳", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "双塔区" //三级选项 字符串
			}, {
				"name": "龙城区" //三级选项 字符串
			}, {
				"name": "朝阳县" //三级选项 字符串
			}, {
				"name": "建平县" //三级选项 字符串
			}, {
				"name": "喀喇沁左翼蒙古族自治县" //三级选项 字符串
			}, {
				"name": "北票市" //三级选项 字符串
			}, {
				"name": "凌源市" //三级选项 字符串
			},
		]
	}, {
		"name": "葫芦岛", //二级选项 字符串
		"sub": [ //JSON数组
			{
				"name": "连山区" //三级选项 字符串
			}, {
				"name": "龙港区" //三级选项 字符串
			}, {
				"name": "南票区" //三级选项 字符串
			}, {
				"name": "绥中县" //三级选项 字符串
			}, {
				"name": "建昌县" //三级选项 字符串
			}, {
				"name": "兴城市" //三级选项 字符串
			},
		]
	}]
},
{
	"name": "吉林省", //一级选项 字符串
	"sub": [ //JSON数组
		{
			"name": "长春", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "南关区" //三级选项 字符串
				}, {
					"name": "宽城区" //三级选项 字符串
				}, {
					"name": "朝阳区" //三级选项 字符串
				}, {
					"name": "二道区" //三级选项 字符串
				}, {
					"name": "绿园区" //三级选项 字符串
				}, {
					"name": "双阳区" //三级选项 字符串
				}, {
					"name": "农安县" //三级选项 字符串
				}, {
					"name": "九台市" //三级选项 字符串
				}, {
					"name": "榆树市" //三级选项 字符串
				}, {
					"name": "德惠市" //三级选项 字符串
				},
			]
		}, {
			"name": "吉林", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "昌邑区" //三级选项 字符串
				}, {
					"name": "龙潭区" //三级选项 字符串
				}, {
					"name": "船营区" //三级选项 字符串
				}, {
					"name": "丰满区" //三级选项 字符串
				}, {
					"name": "永吉县" //三级选项 字符串
				}, {
					"name": "蛟河市" //三级选项 字符串
				}, {
					"name": "桦甸市" //三级选项 字符串
				}, {
					"name": "舒兰市" //三级选项 字符串
				}, {
					"name": "磐石市" //三级选项 字符串
				},
			]
		}, {
			"name": "四平", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "铁西区" //三级选项 字符串
				}, {
					"name": "铁东区" //三级选项 字符串
				}, {
					"name": "梨树县" //三级选项 字符串
				}, {
					"name": "伊通满族自治县" //三级选项 字符串
				}, {
					"name": "公主岭市" //三级选项 字符串
				}, {
					"name": "双辽市" //三级选项 字符串
				},
			]
		}, {
			"name": "辽源", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "龙山区" //三级选项 字符串
				}, {
					"name": "西安区" //三级选项 字符串
				}, {
					"name": "东丰县" //三级选项 字符串
				}, {
					"name": "东辽县" //三级选项 字符串
				},
			]
		}, {
			"name": "通化", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "东昌区" //三级选项 字符串
				}, {
					"name": "二道江区" //三级选项 字符串
				}, {
					"name": "通化县" //三级选项 字符串
				}, {
					"name": "辉南县" //三级选项 字符串
				}, {
					"name": "柳河县" //三级选项 字符串
				}, {
					"name": "梅河口市" //三级选项 字符串
				}, {
					"name": "集安市" //三级选项 字符串
				},
			]
		}, {
			"name": "白山", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "八道江区" //三级选项 字符串
				}, {
					"name": "江源区" //三级选项 字符串
				}, {
					"name": "抚松县" //三级选项 字符串
				}, {
					"name": "靖宇县" //三级选项 字符串
				}, {
					"name": "长白朝鲜族自治县" //三级选项 字符串
				}, {
					"name": "临江市" //三级选项 字符串
				},
			]
		}, {
			"name": "松原", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "宁江区" //三级选项 字符串
				}, {
					"name": "前郭尔罗斯蒙古族自治县" //三级选项 字符串
				}, {
					"name": "长岭县" //三级选项 字符串
				}, {
					"name": "乾安县" //三级选项 字符串
				}, {
					"name": "扶余县" //三级选项 字符串
				},
			]
		}, {
			"name": "白城", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "洮北区" //三级选项 字符串
				}, {
					"name": "镇赉县" //三级选项 字符串
				}, {
					"name": "通榆县" //三级选项 字符串
				}, {
					"name": "洮南县" //三级选项 字符串
				}, {
					"name": "大安市" //三级选项 字符串
				},
			]
		}, {
			"name": "延边", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "延吉市" //三级选项 字符串
				}, {
					"name": "图们市" //三级选项 字符串
				}, {
					"name": "敦化市" //三级选项 字符串
				}, {
					"name": "珲春市" //三级选项 字符串
				}, {
					"name": "龙井市" //三级选项 字符串
				}, {
					"name": "和龙市" //三级选项 字符串
				}, {
					"name": "汪清县" //三级选项 字符串
				}, {
					"name": "安图县" //三级选项 字符串
				},
			]
		},
	]
},
{
	"name": "黑龙江省", //一级选项 字符串
	"sub": [ //JSON数组
		{
			"name": "哈尔滨", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "道里区" //三级选项 字符串
				}, {
					"name": "南岗区" //三级选项 字符串
				}, {
					"name": "道外区" //三级选项 字符串
				}, {
					"name": "平房区" //三级选项 字符串
				}, {
					"name": "松北区" //三级选项 字符串
				}, {
					"name": "香坊区" //三级选项 字符串
				}, {
					"name": "呼兰区" //三级选项 字符串
				}, {
					"name": "阿城区" //三级选项 字符串
				}, {
					"name": "依兰县" //三级选项 字符串
				}, {
					"name": "方正县" //三级选项 字符串
				}, {
					"name": "宾县" //三级选项 字符串
				}, {
					"name": "巴彦县" //三级选项 字符串
				}, {
					"name": "木兰县" //三级选项 字符串
				}, {
					"name": "通河县" //三级选项 字符串
				}, {
					"name": "延寿县" //三级选项 字符串
				}, {
					"name": "双城市" //三级选项 字符串
				}, {
					"name": "尚志市" //三级选项 字符串
				}, {
					"name": "五常市" //三级选项 字符串
				},
			]
		}, {
			"name": "齐齐哈尔", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "龙沙区" //三级选项 字符串
				}, {
					"name": "建华区" //三级选项 字符串
				}, {
					"name": "铁锋区" //三级选项 字符串
				}, {
					"name": "昂昂溪区" //三级选项 字符串
				}, {
					"name": "富拉尔基区" //三级选项 字符串
				}, {
					"name": "碾子山区" //三级选项 字符串
				}, {
					"name": "梅里斯达斡尔族区" //三级选项 字符串
				}, {
					"name": "龙江县" //三级选项 字符串
				}, {
					"name": "依安县" //三级选项 字符串
				}, {
					"name": "泰来县" //三级选项 字符串
				}, {
					"name": "甘南县" //三级选项 字符串
				}, {
					"name": "富裕县" //三级选项 字符串
				}, {
					"name": "克山县" //三级选项 字符串
				}, {
					"name": "克东县" //三级选项 字符串
				}, {
					"name": "拜泉县" //三级选项 字符串
				}, {
					"name": "讷河市" //三级选项 字符串
				},
			]
		}, {
			"name": "鸡西", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "鸡冠区" //三级选项 字符串
				}, {
					"name": "恒山区" //三级选项 字符串
				}, {
					"name": "滴道区" //三级选项 字符串
				}, {
					"name": "梨树区" //三级选项 字符串
				}, {
					"name": "城子河区" //三级选项 字符串
				}, {
					"name": "麻山区" //三级选项 字符串
				}, {
					"name": "鸡东县" //三级选项 字符串
				}, {
					"name": "虎林市" //三级选项 字符串
				}, {
					"name": "密山市" //三级选项 字符串
				},
			]
		}, {
			"name": "鹤岗", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "向阳区" //三级选项 字符串
				}, {
					"name": "工农区" //三级选项 字符串
				}, {
					"name": "南山区" //三级选项 字符串
				}, {
					"name": "兴安区" //三级选项 字符串
				}, {
					"name": "东山区" //三级选项 字符串
				}, {
					"name": "兴山区" //三级选项 字符串
				}, {
					"name": "萝北县" //三级选项 字符串
				}, {
					"name": "绥滨县" //三级选项 字符串
				},
			]
		}, {
			"name": "双鸭山", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "尖山区" //三级选项 字符串
				}, {
					"name": "岭东区" //三级选项 字符串
				}, {
					"name": "四方台区" //三级选项 字符串
				}, {
					"name": "宝山区" //三级选项 字符串
				}, {
					"name": "集贤县" //三级选项 字符串
				}, {
					"name": "友谊县" //三级选项 字符串
				}, {
					"name": "宝清县" //三级选项 字符串
				}, {
					"name": "饶河县" //三级选项 字符串
				},
			]
		}, {
			"name": "大庆", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "萨尔图区" //三级选项 字符串
				}, {
					"name": "龙凤区" //三级选项 字符串
				}, {
					"name": "让胡路区" //三级选项 字符串
				}, {
					"name": "红岗区" //三级选项 字符串
				}, {
					"name": "大同区" //三级选项 字符串
				}, {
					"name": "肇州县" //三级选项 字符串
				}, {
					"name": "肇源县" //三级选项 字符串
				}, {
					"name": "林甸县" //三级选项 字符串
				}, {
					"name": "杜尔伯特蒙古族自治县" //三级选项 字符串
				},
			]
		}, {
			"name": "伊春", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "伊春区" //三级选项 字符串
				}, {
					"name": "南岔区" //三级选项 字符串
				}, {
					"name": "友好区" //三级选项 字符串
				}, {
					"name": "西林区" //三级选项 字符串
				}, {
					"name": "翠峦区" //三级选项 字符串
				}, {
					"name": "金山屯区" //三级选项 字符串
				}, {
					"name": "五营区" //三级选项 字符串
				}, {
					"name": "乌马河区" //三级选项 字符串
				}, {
					"name": "汤旺河区" //三级选项 字符串
				}, {
					"name": "带岭区" //三级选项 字符串
				}, {
					"name": "乌伊岭区" //三级选项 字符串
				}, {
					"name": "红星区" //三级选项 字符串
				}, {
					"name": "上甘岭区" //三级选项 字符串
				}, {
					"name": "嘉荫县" //三级选项 字符串
				}, {
					"name": "铁力市" //三级选项 字符串
				},
			]
		}, {
			"name": "佳木斯", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "向阳区" //三级选项 字符串
				}, {
					"name": "前进区" //三级选项 字符串
				}, {
					"name": "东风区" //三级选项 字符串
				}, {
					"name": "郊区" //三级选项 字符串
				}, {
					"name": "桦南县" //三级选项 字符串
				}, {
					"name": "桦川县" //三级选项 字符串
				}, {
					"name": "汤原县" //三级选项 字符串
				}, {
					"name": "抚远县" //三级选项 字符串
				}, {
					"name": "同江市" //三级选项 字符串
				}, {
					"name": "富锦市" //三级选项 字符串
				},
			]
		}, {
			"name": "七台河", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "新兴区" //三级选项 字符串
				}, {
					"name": "桃山区" //三级选项 字符串
				}, {
					"name": "茄子河区" //三级选项 字符串
				}, {
					"name": "勃利县" //三级选项 字符串
				},
			]
		}, {
			"name": "牡丹江", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "东安区" //三级选项 字符串
				}, {
					"name": "阳明区" //三级选项 字符串
				}, {
					"name": "爱民区" //三级选项 字符串
				}, {
					"name": "西安区" //三级选项 字符串
				}, {
					"name": "东宁县" //三级选项 字符串
				}, {
					"name": "林口县" //三级选项 字符串
				}, {
					"name": "绥芬河市" //三级选项 字符串
				}, {
					"name": "海林市" //三级选项 字符串
				}, {
					"name": "宁安市" //三级选项 字符串
				}, {
					"name": "穆棱市" //三级选项 字符串
				},
			]
		}, {
			"name": "黑河", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "爱辉区" //三级选项 字符串
				}, {
					"name": "嫩江县" //三级选项 字符串
				}, {
					"name": "逊克县" //三级选项 字符串
				}, {
					"name": "孙吴县" //三级选项 字符串
				}, {
					"name": "北安市" //三级选项 字符串
				}, {
					"name": "五大连池市" //三级选项 字符串
				},

			]
		}, {
			"name": "绥化", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "北林区" //三级选项 字符串
				}, {
					"name": "望奎县" //三级选项 字符串
				}, {
					"name": "兰西县" //三级选项 字符串
				}, {
					"name": "青冈县" //三级选项 字符串
				}, {
					"name": "庆安县" //三级选项 字符串
				}, {
					"name": "明水县" //三级选项 字符串
				}, {
					"name": "绥棱县" //三级选项 字符串
				}, {
					"name": "安达市" //三级选项 字符串
				}, {
					"name": "肇东市" //三级选项 字符串
				}, {
					"name": "海伦市" //三级选项 字符串
				},

			]
		}, {
			"name": "大兴安岭", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "呼玛县" //三级选项 字符串
				}, {
					"name": "塔河县" //三级选项 字符串
				}, {
					"name": "漠河县" //三级选项 字符串
				},

			]
		},
	]
},
{
	"name": "江苏省", //一级选项 字符串
	"sub": [ //JSON数组
		{
			"name": "南京", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "玄武区" //三级选项 字符串
				}, {
					"name": "白下区" //三级选项 字符串
				}, {
					"name": "秦淮区" //三级选项 字符串
				}, {
					"name": "建邺区" //三级选项 字符串
				}, {
					"name": "鼓楼区" //三级选项 字符串
				}, {
					"name": "下关区" //三级选项 字符串
				}, {
					"name": "浦口区" //三级选项 字符串
				}, {
					"name": "栖霞区" //三级选项 字符串
				}, {
					"name": "雨花台区" //三级选项 字符串
				}, {
					"name": "江宁区" //三级选项 字符串
				}, {
					"name": "六合区" //三级选项 字符串
				}, {
					"name": "溧水县" //三级选项 字符串
				}, {
					"name": "高淳县" //三级选项 字符串
				},

			]
		}, {
			"name": "无锡", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "崇安区" //三级选项 字符串
				}, {
					"name": "南长区" //三级选项 字符串
				}, {
					"name": "北塘区" //三级选项 字符串
				}, {
					"name": "锡山区" //三级选项 字符串
				}, {
					"name": "惠山区" //三级选项 字符串
				}, {
					"name": "滨湖区" //三级选项 字符串
				}, {
					"name": "江阴市" //三级选项 字符串
				}, {
					"name": "宜兴市" //三级选项 字符串
				},

			]
		}, {
			"name": "徐州", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "鼓楼区" //三级选项 字符串
				}, {
					"name": "云龙区" //三级选项 字符串
				}, {
					"name": "九里区" //三级选项 字符串
				}, {
					"name": "贾汪区" //三级选项 字符串
				}, {
					"name": "泉山区" //三级选项 字符串
				}, {
					"name": "丰县" //三级选项 字符串
				}, {
					"name": "沛县" //三级选项 字符串
				}, {
					"name": "铜山县" //三级选项 字符串
				}, {
					"name": "睢宁县" //三级选项 字符串
				}, {
					"name": "新沂市" //三级选项 字符串
				}, {
					"name": "邳州市" //三级选项 字符串
				},
			]
		}, {
			"name": "常州", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "天宁区" //三级选项 字符串
				}, {
					"name": "钟楼区" //三级选项 字符串
				}, {
					"name": "戚墅堰区" //三级选项 字符串
				}, {
					"name": "武进区" //三级选项 字符串
				}, {
					"name": "溧阳市" //三级选项 字符串
				}, {
					"name": "金坛市" //三级选项 字符串
				},

			]
		}, {
			"name": "苏州", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "姑苏区" //三级选项 字符串
				}, {
					"name": "虎丘区" //三级选项 字符串
				}, {
					"name": "吴中区" //三级选项 字符串
				}, {
					"name": "相城区" //三级选项 字符串
				}, {
					"name": "吴江区" //三级选项 字符串
				}, {
					"name": "常熟市" //三级选项 字符串
				}, {
					"name": "张家港市" //三级选项 字符串
				}, {
					"name": "昆山市" //三级选项 字符串
				}, {
					"name": "太仓市" //三级选项 字符串
				},

			]
		}, {
			"name": "南通", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "崇川区" //三级选项 字符串
				}, {
					"name": "港闸区" //三级选项 字符串
				}, {
					"name": "海安县" //三级选项 字符串
				}, {
					"name": "如东县" //三级选项 字符串
				}, {
					"name": "启东市" //三级选项 字符串
				}, {
					"name": "如皋市" //三级选项 字符串
				}, {
					"name": "通州市" //三级选项 字符串
				}, {
					"name": "海门市" //三级选项 字符串
				},
			]
		}, {
			"name": "连云港", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "连云区" //三级选项 字符串
				}, {
					"name": "新浦区" //三级选项 字符串
				}, {
					"name": "海州区" //三级选项 字符串
				}, {
					"name": "赣榆县" //三级选项 字符串
				}, {
					"name": "东海县" //三级选项 字符串
				}, {
					"name": "灌云县" //三级选项 字符串
				}, {
					"name": "灌南县" //三级选项 字符串
				},

			]
		}, {
			"name": "淮安", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "清河区" //三级选项 字符串
				}, {
					"name": "淮安区" //三级选项 字符串
				}, {
					"name": "淮阴区" //三级选项 字符串
				}, {
					"name": "清浦区" //三级选项 字符串
				}, {
					"name": "涟水县" //三级选项 字符串
				}, {
					"name": "洪泽县" //三级选项 字符串
				}, {
					"name": "盱眙县" //三级选项 字符串
				}, {
					"name": "金湖县" //三级选项 字符串
				},

			]
		}, {
			"name": "盐城", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "亭湖区" //三级选项 字符串
				}, {
					"name": "盐都区" //三级选项 字符串
				}, {
					"name": "响水县" //三级选项 字符串
				}, {
					"name": "滨海县" //三级选项 字符串
				}, {
					"name": "阜宁县" //三级选项 字符串
				}, {
					"name": "射阳县" //三级选项 字符串
				}, {
					"name": "建湖县" //三级选项 字符串
				}, {
					"name": "东台市" //三级选项 字符串
				}, {
					"name": "大丰市" //三级选项 字符串
				},

			]
		}, {
			"name": "扬州", //二级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "广陵区" //三级选项 字符串
				}, {
					"name": "邗江区" //三级选项 字符串
				}, {
					"name": "维扬区" //三级选项 字符串
				}, {
					"name": "仪征市" //三级选项 字符串
				}, {
					"name": "高邮市" //三级选项 字符串
				}, {
					"name": "江都市" //三级选项 字符串
				}, {
					"name": "镇江", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "京口区" //三级选项 字符串
						}, {
							"name": "润州区" //三级选项 字符串
						}, {
							"name": "丹徒区" //三级选项 字符串
						}, {
							"name": "丹阳市" //三级选项 字符串
						}, {
							"name": "扬中市" //三级选项 字符串
						}, {
							"name": "句容市" //三级选项 字符串
						},

					]
				}, {
					"name": "泰州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "海陵区" //三级选项 字符串
						}, {
							"name": "高港区" //三级选项 字符串
						}, {
							"name": "兴化市" //三级选项 字符串
						}, {
							"name": "靖江市" //三级选项 字符串
						}, {
							"name": "泰兴市" //三级选项 字符串
						}, {
							"name": "姜堰市" //三级选项 字符串
						},

					]
				}, {
					"name": "宿迁", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "宿城区" //三级选项 字符串
						}, {
							"name": "宿豫区" //三级选项 字符串
						}, {
							"name": "沐阳县" //三级选项 字符串
						}, {
							"name": "泗阳县" //三级选项 字符串
						}, {
							"name": "泗洪县" //三级选项 字符串
						},
					]
				},
			]}]
		}, {
			"name": "浙江省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "杭州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "上城区" //三级选项 字符串
						}, {
							"name": "下城区" //三级选项 字符串
						}, {
							"name": "江干区" //三级选项 字符串
						}, {
							"name": "拱墅区" //三级选项 字符串
						}, {
							"name": "滨江区" //三级选项 字符串
						}, {
							"name": "萧山区" //三级选项 字符串
						}, {
							"name": "余杭区" //三级选项 字符串
						}, {
							"name": "桐庐县" //三级选项 字符串
						}, {
							"name": "淳安县" //三级选项 字符串
						}, {
							"name": "富阳市" //三级选项 字符串
						}, {
							"name": "临安市" //三级选项 字符串
						},
					]
				}, {
					"name": "宁波", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "海曙区" //三级选项 字符串
						}, {
							"name": "江东区" //三级选项 字符串
						}, {
							"name": "江北区" //三级选项 字符串
						}, {
							"name": "北仑区" //三级选项 字符串
						}, {
							"name": "镇海区" //三级选项 字符串
						}, {
							"name": "鄞州区" //三级选项 字符串
						}, {
							"name": "象山县" //三级选项 字符串
						}, {
							"name": "宁海县" //三级选项 字符串
						}, {
							"name": "余姚市" //三级选项 字符串
						}, {
							"name": "慈溪市" //三级选项 字符串
						}, {
							"name": "奉化市" //三级选项 字符串
						},
					]
				}, {
					"name": "温州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "鹿城区" //三级选项 字符串
						}, {
							"name": "龙湾区" //三级选项 字符串
						}, {
							"name": "瓯海区" //三级选项 字符串
						}, {
							"name": "洞头县" //三级选项 字符串
						}, {
							"name": "永嘉县" //三级选项 字符串
						}, {
							"name": "平阳县" //三级选项 字符串
						}, {
							"name": "苍南县" //三级选项 字符串
						}, {
							"name": "文成县" //三级选项 字符串
						}, {
							"name": "泰顺县" //三级选项 字符串
						}, {
							"name": "瑞安市" //三级选项 字符串
						}, {
							"name": "乐清市" //三级选项 字符串
						},
					]
				}, {
					"name": "嘉兴", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "南湖区" //三级选项 字符串
						}, {
							"name": "秀洲区" //三级选项 字符串
						}, {
							"name": "嘉善县" //三级选项 字符串
						}, {
							"name": "海盐县" //三级选项 字符串
						}, {
							"name": "海宁市" //三级选项 字符串
						}, {
							"name": "平湖市" //三级选项 字符串
						}, {
							"name": "桐乡市" //三级选项 字符串
						},
					]
				}, {
					"name": "湖州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "吴兴区" //三级选项 字符串
						}, {
							"name": "南浔区" //三级选项 字符串
						}, {
							"name": "德清县" //三级选项 字符串
						}, {
							"name": "长兴县" //三级选项 字符串
						}, {
							"name": "安吉县" //三级选项 字符串
						},
					]
				}, {
					"name": "绍兴", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "越城区" //三级选项 字符串
						}, {
							"name": "绍兴县" //三级选项 字符串
						}, {
							"name": "新昌县" //三级选项 字符串
						}, {
							"name": "诸暨市" //三级选项 字符串
						}, {
							"name": "上虞市" //三级选项 字符串
						}, {
							"name": "嵊州市" //三级选项 字符串
						},
					]
				}, {
					"name": "金华", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "婺城区" //三级选项 字符串
						}, {
							"name": "金东区" //三级选项 字符串
						}, {
							"name": "武义县" //三级选项 字符串
						}, {
							"name": "浦江县" //三级选项 字符串
						}, {
							"name": "磐安县" //三级选项 字符串
						}, {
							"name": "兰溪市" //三级选项 字符串
						}, {
							"name": "义乌市" //三级选项 字符串
						}, {
							"name": "东阳市" //三级选项 字符串
						}, {
							"name": "永康市" //三级选项 字符串
						},
					]
				},{
						"name": "衢州", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "柯城区" //三级选项 字符串
							}, {
								"name": "衢江区" //三级选项 字符串
							}, {
								"name": "常山县" //三级选项 字符串
							}, {
								"name": "开化县" //三级选项 字符串
							}, {
								"name": "龙游县" //三级选项 字符串
							}, {
								"name": "江山市" //三级选项 字符串
							},
						]
					},{
							"name": "舟山", //二级选项 字符串
							"sub": [ //JSON数组
								{
									"name": "定海区" //三级选项 字符串
								}, {
									"name": "普陀区" //三级选项 字符串
								}, {
									"name": "岱山县" //三级选项 字符串
								}, {
									"name": "嵊泗县" //三级选项 字符串
								},
							]
					},{
							"name": "台州", //二级选项 字符串
							"sub": [ //JSON数组
								{
									"name": "椒江区" //三级选项 字符串
								}, {
									"name": "黄岩区" //三级选项 字符串
								}, {
									"name": "路桥区" //三级选项 字符串
								}, {
									"name": "将环县" //三级选项 字符串
								}, {
									"name": "三门县" //三级选项 字符串
								}, {
									"name": "天台县" //三级选项 字符串
								}, {
									"name": "仙居县" //三级选项 字符串
								}, {
									"name": "温岭市" //三级选项 字符串
								}, {
									"name": "临海市" //三级选项 字符串
								},
							]
					},{
							"name": "丽水", //二级选项 字符串
							"sub": [ //JSON数组
								{
									"name": "莲都区" //三级选项 字符串
								}, {
									"name": "青田县" //三级选项 字符串
								}, {
									"name": "缙云县" //三级选项 字符串
								}, {
									"name": "遂昌县" //三级选项 字符串
								}, {
									"name": "松阳县" //三级选项 字符串
								}, {
									"name": "云和县" //三级选项 字符串
								}, {
									"name": "庆元县" //三级选项 字符串
								}, {
									"name": "景宁畲族自治县" //三级选项 字符串
								}, {
									"name": "龙泉市" //三级选项 字符串
								},
							]
					},
			]
		}, {
			"name": "安徽省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "合肥", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "瑶海区" //三级选项 字符串
						}, {
							"name": "庐阳区" //三级选项 字符串
						}, {
							"name": "蜀山区" //三级选项 字符串
						}, {
							"name": "包河区" //三级选项 字符串
						}, {
							"name": "长丰县" //三级选项 字符串
						}, {
							"name": "肥东县" //三级选项 字符串
						}, {
							"name": "肥西县" //三级选项 字符串
						}, {
							"name": "庐江县" //三级选项 字符串
						}, {
							"name": "巢湖市" //三级选项 字符串
						},
					]
				},{
						"name": "芜湖", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "镜湖区" //三级选项 字符串
							}, {
								"name": "戈江区" //三级选项 字符串
							}, {
								"name": "鸠江区" //三级选项 字符串
							}, {
								"name": "三山区" //三级选项 字符串
							}, {
								"name": "芜湖县" //三级选项 字符串
							}, {
								"name": "繁昌县" //三级选项 字符串
							}, {
								"name": "南陵县" //三级选项 字符串
							}, {
								"name": "无为县" //三级选项 字符串
							},
						]
				},{
						"name": "蚌埠", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "龙子湖区" //三级选项 字符串
							}, {
								"name": "蚌山区" //三级选项 字符串
							}, {
								"name": "禹会区" //三级选项 字符串
							}, {
								"name": "怀远县" //三级选项 字符串
							}, {
								"name": "五河县" //三级选项 字符串
							}, {
								"name": "固镇县" //三级选项 字符串
							},
						]
				},{
						"name": "淮南", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "大通区" //三级选项 字符串
							}, {
								"name": "田家庵区" //三级选项 字符串
							}, {
								"name": "谢家集区" //三级选项 字符串
							}, {
								"name": "八公山去" //三级选项 字符串
							}, {
								"name": "潘集区" //三级选项 字符串
							}, {
								"name": "凤台县" //三级选项 字符串
							},
						]
				},{
						"name": "马鞍山", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "花山区" //三级选项 字符串
							}, {
								"name": "雨山区" //三级选项 字符串
							}, {
								"name": "博望区" //三级选项 字符串
							}, {
								"name": "当涂县" //三级选项 字符串
							}, {
								"name": "含山县" //三级选项 字符串
							}, {
								"name": "含山县" //三级选项 字符串
							},
						]
				},{
						"name": "淮北", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "杜集区" //三级选项 字符串
							}, {
								"name": "相山区" //三级选项 字符串
							}, {
								"name": "烈山区" //三级选项 字符串
							}, {
								"name": "濉溪县" //三级选项 字符串
							},
						]
				},{
						"name": "铜陵", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "铜官山区" //三级选项 字符串
							}, {
								"name": "狮子山区" //三级选项 字符串
							}, {
								"name": "郊区" //三级选项 字符串
							}, {
								"name": "铜陵县" //三级选项 字符串
							},
						]
				},{
						"name": "安庆", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "迎江区" //三级选项 字符串
							}, {
								"name": "大观区" //三级选项 字符串
							}, {
								"name": "宜秀区" //三级选项 字符串
							}, {
								"name": "怀宁县" //三级选项 字符串
							}, {
								"name": "枞阳县" //三级选项 字符串
							}, {
								"name": "潜山县" //三级选项 字符串
							}, {
								"name": "太湖县" //三级选项 字符串
							}, {
								"name": "宿松县" //三级选项 字符串
							}, {
								"name": "望江县" //三级选项 字符串
							}, {
								"name": "岳西县" //三级选项 字符串
							}, {
								"name": "桐城市" //三级选项 字符串
							}, 						]
				},{
						"name": "黄山", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "屯溪区" //三级选项 字符串
							}, {
								"name": "黄山区" //三级选项 字符串
							}, {
								"name": "徽州区" //三级选项 字符串
							}, {
								"name": "歙县" //三级选项 字符串
							}, {
								"name": "休宁县" //三级选项 字符串
							}, {
								"name": "黟县" //三级选项 字符串
							}, {
								"name": "祁门县" //三级选项 字符串
							},
						]
				},{
						"name": "滁州", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "琅琊区" //三级选项 字符串
							}, {
								"name": "南谯区" //三级选项 字符串
							}, {
								"name": "来安县" //三级选项 字符串
							}, {
								"name": "全椒县" //三级选项 字符串
							}, {
								"name": "定远县" //三级选项 字符串
							}, {
								"name": "凤阳县" //三级选项 字符串
							}, {
								"name": "天长市" //三级选项 字符串
							}, {
								"name": "明光市" //三级选项 字符串
							},
						]
				},{
						"name": "阜阳", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "颖川区" //三级选项 字符串
							}, {
								"name": "颍东区" //三级选项 字符串
							}, {
								"name": "颍泉区" //三级选项 字符串
							}, {
								"name": "临泉县" //三级选项 字符串
							}, {
								"name": "太和县" //三级选项 字符串
							}, {
								"name": "阜南县" //三级选项 字符串
							}, {
								"name": "颍上县" //三级选项 字符串
							}, {
								"name": "界首市" //三级选项 字符串
							},
						]
				},{
						"name": "宿州", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "埇桥区" //三级选项 字符串
							}, {
								"name": "砀山县" //三级选项 字符串
							}, {
								"name": "萧县" //三级选项 字符串
							}, {
								"name": "泗县" //三级选项 字符串
							},
						]
				},{
						"name": "六安", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "金安区" //三级选项 字符串
							}, {
								"name": "裕安区" //三级选项 字符串
							}, {
								"name": "寿县" //三级选项 字符串
							}, {
								"name": "霍邱县" //三级选项 字符串
							}, {
								"name": "舒城县" //三级选项 字符串
							}, {
								"name": "金寨县" //三级选项 字符串
							}, {
								"name": "霍山县" //三级选项 字符串
							},
						]
				},{
						"name": "毫州", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "谯城区" //三级选项 字符串
							}, {
								"name": "涡阳县" //三级选项 字符串
							}, {
								"name": "蒙城县" //三级选项 字符串
							}, {
								"name": "利辛县" //三级选项 字符串
							},
						]
				},{
						"name": "池州", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "贵池区" //三级选项 字符串
							}, {
								"name": "东至县" //三级选项 字符串
							}, {
								"name": "石台县" //三级选项 字符串
							}, {
								"name": "青阳县" //三级选项 字符串
							},
						]
				},{
						"name": "宣城", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "宣州区" //三级选项 字符串
							}, {
								"name": "郎溪县" //三级选项 字符串
							}, {
								"name": "广德县" //三级选项 字符串
							}, {
								"name": "泾县" //三级选项 字符串
							}, {
								"name": "绩溪县" //三级选项 字符串
							}, {
								"name": "旌德县" //三级选项 字符串
							}, {
								"name": "宁国市" //三级选项 字符串
							},
						]
				},
			]
		}, {
			"name": "福建省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "福州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "鼓楼区" //三级选项 字符串
						}, {
							"name": "台江区" //三级选项 字符串
						}, {
							"name": "仓山区" //三级选项 字符串
						}, {
							"name": "马尾区" //三级选项 字符串
						}, {
							"name": "晋安区" //三级选项 字符串
						}, {
							"name": "闽侯县" //三级选项 字符串
						}, {
							"name": "连江县" //三级选项 字符串
						}, {
							"name": "罗源县" //三级选项 字符串
						}, {
							"name": "闽清县" //三级选项 字符串
						}, {
							"name": "永泰县" //三级选项 字符串
						}, {
							"name": "平潭县" //三级选项 字符串
						}, {
							"name": "福清市" //三级选项 字符串
						},{
							"name": "长乐市" //三级选项 字符串
						},
					]
				},{
					"name": "厦门", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "思明区" //三级选项 字符串
						}, {
							"name": "海沧区" //三级选项 字符串
						}, {
							"name": "湖里区" //三级选项 字符串
						}, {
							"name": "集美区" //三级选项 字符串
						}, {
							"name": "同安区" //三级选项 字符串
						}, {
							"name": "翔安区" //三级选项 字符串
						},
					]
				},{
					"name": "莆田", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "城厢区" //三级选项 字符串
						}, {
							"name": "涵江区" //三级选项 字符串
						}, {
							"name": "荔城区" //三级选项 字符串
						}, {
							"name": "秀屿区" //三级选项 字符串
						}, {
							"name": "仙游县" //三级选项 字符串
						},
					]
				},{
					"name": "三明", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "梅列区" //三级选项 字符串
						}, {
							"name": "三元区" //三级选项 字符串
						}, {
							"name": "明溪县" //三级选项 字符串
						}, {
							"name": "清流县" //三级选项 字符串
						}, {
							"name": "宁化县" //三级选项 字符串
						}, {
							"name": "大田县" //三级选项 字符串
						}, {
							"name": "尤溪县" //三级选项 字符串
						}, {
							"name": "沙县" //三级选项 字符串
						}, {
							"name": "将乐县" //三级选项 字符串
						}, {
							"name": "泰宁县" //三级选项 字符串
						}, {
							"name": "建宁县" //三级选项 字符串
						}, {
							"name": "永安市" //三级选项 字符串
						},
					]
				},{
					"name": "泉州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "鲤城区" //三级选项 字符串
						}, {
							"name": "丰泽区" //三级选项 字符串
						}, {
							"name": "洛江区" //三级选项 字符串
						}, {
							"name": "泉港区" //三级选项 字符串
						}, {
							"name": "惠安县" //三级选项 字符串
						}, {
							"name": "安溪县" //三级选项 字符串
						}, {
							"name": "永春县" //三级选项 字符串
						}, {
							"name": "德化县" //三级选项 字符串
						}, {
							"name": "金门县" //三级选项 字符串
						}, {
							"name": "石狮市" //三级选项 字符串
						}, {
							"name": "晋江市" //三级选项 字符串
						}, {
							"name": "南安市" //三级选项 字符串
						},
					]
				},{
					"name": "漳州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "芗城区" //三级选项 字符串
						}, {
							"name": "龙文区" //三级选项 字符串
						}, {
							"name": "云霄县" //三级选项 字符串
						}, {
							"name": "漳浦县" //三级选项 字符串
						}, {
							"name": "诏安县" //三级选项 字符串
						}, {
							"name": "长泰县" //三级选项 字符串
						}, {
							"name": "东山县" //三级选项 字符串
						}, {
							"name": "南靖县" //三级选项 字符串
						}, {
							"name": "平和县" //三级选项 字符串
						}, {
							"name": "华安县" //三级选项 字符串
						}, {
							"name": "龙海市" //三级选项 字符串
						},
					]
				},{
					"name": "南平", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "延平区" //三级选项 字符串
						}, {
							"name": "顺昌县" //三级选项 字符串
						}, {
							"name": "蒲城县" //三级选项 字符串
						}, {
							"name": "光泽县" //三级选项 字符串
						}, {
							"name": "松溪县" //三级选项 字符串
						}, {
							"name": "政和县" //三级选项 字符串
						}, {
							"name": "邵武市" //三级选项 字符串
						}, {
							"name": "武夷山市" //三级选项 字符串
						}, {
							"name": "建瓯市" //三级选项 字符串
						}, {
							"name": "建阳市" //三级选项 字符串
						},
					]
				},{
					"name": "龙岩", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "新罗区" //三级选项 字符串
						}, {
							"name": "长汀县" //三级选项 字符串
						}, {
							"name": "永定县" //三级选项 字符串
						}, {
							"name": "上杭县" //三级选项 字符串
						}, {
							"name": "武平县" //三级选项 字符串
						}, {
							"name": "连城县" //三级选项 字符串
						}, {
							"name": "漳平市" //三级选项 字符串
						},
					]
				},{
					"name": "宁德", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "蕉城区" //三级选项 字符串
						}, {
							"name": "霞浦县" //三级选项 字符串
						}, {
							"name": "古田县" //三级选项 字符串
						}, {
							"name": "屏南县" //三级选项 字符串
						}, {
							"name": "寿宁县" //三级选项 字符串
						}, {
							"name": "周宁县" //三级选项 字符串
						}, {
							"name": "柘荣县" //三级选项 字符串
						}, {
							"name": "福安市" //三级选项 字符串
						}, {
							"name": "福鼎市" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "江西省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "南昌", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "东湖区" //三级选项 字符串
						}, {
							"name": "西湖区" //三级选项 字符串
						}, {
							"name": "青云谱区" //三级选项 字符串
						}, {
							"name": "湾里区" //三级选项 字符串
						}, {
							"name": "青山湖区" //三级选项 字符串
						}, {
							"name": "南昌县" //三级选项 字符串
						}, {
							"name": "新建县" //三级选项 字符串
						}, {
							"name": "安义县" //三级选项 字符串
						}, {
							"name": "进贤县" //三级选项 字符串
						},
					]
				},{
					"name": "景德镇", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "昌江区" //三级选项 字符串
						}, {
							"name": "珠山区" //三级选项 字符串
						}, {
							"name": "浮梁县" //三级选项 字符串
						}, {
							"name": "乐平市" //三级选项 字符串
						},
					]
				},{
					"name": "萍乡", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "安源区" //三级选项 字符串
						}, {
							"name": "湘东区" //三级选项 字符串
						}, {
							"name": "莲花县" //三级选项 字符串
						}, {
							"name": "上栗县" //三级选项 字符串
						}, {
							"name": "芦溪县" //三级选项 字符串
						},
					]
				},{
					"name": "九江", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "庐山区" //三级选项 字符串
						}, {
							"name": "浔阳区" //三级选项 字符串
						}, {
							"name": "九江县" //三级选项 字符串
						}, {
							"name": "武宁县" //三级选项 字符串
						}, {
							"name": "修水县" //三级选项 字符串
						}, {
							"name": "永修县" //三级选项 字符串
						}, {
							"name": "德安县" //三级选项 字符串
						}, {
							"name": "星子县" //三级选项 字符串
						}, {
							"name": "都昌县" //三级选项 字符串
						}, {
							"name": "湖口县" //三级选项 字符串
						}, {
							"name": "彭泽县" //三级选项 字符串
						}, {
							"name": "瑞昌市" //三级选项 字符串
						},
					]
				},{
					"name": "新余", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "渝水区" //三级选项 字符串
						}, {
							"name": "分宜县" //三级选项 字符串
						},
					]
				},{
					"name": "鹰潭", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "月湖区" //三级选项 字符串
						}, {
							"name": "余江县" //三级选项 字符串
						}, {
							"name": "贵溪市" //三级选项 字符串
						},
					]
				},{
					"name": "赣州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "章贡区" //三级选项 字符串
						}, {
							"name": "赣县" //三级选项 字符串
						}, {
							"name": "信丰县" //三级选项 字符串
						}, {
							"name": "大余县" //三级选项 字符串
						}, {
							"name": "上犹县" //三级选项 字符串
						}, {
							"name": "崇义县" //三级选项 字符串
						}, {
							"name": "安远县" //三级选项 字符串
						}, {
							"name": "龙南县" //三级选项 字符串
						}, {
							"name": "定南县" //三级选项 字符串
						}, {
							"name": "全南县" //三级选项 字符串
						}, {
							"name": "宁都县" //三级选项 字符串
						}, {
							"name": "于都县" //三级选项 字符串
						},{
							"name": "兴国县" //三级选项 字符串
						}, {
							"name": "会昌县" //三级选项 字符串
						}, {
							"name": "寻乌县" //三级选项 字符串
						}, {
							"name": "石城县" //三级选项 字符串
						}, {
							"name": "瑞金市" //三级选项 字符串
						}, {
							"name": "南康市" //三级选项 字符串
						},
					]
				},{
					"name": "吉安", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "吉州区" //三级选项 字符串
						}, {
							"name": "青原区" //三级选项 字符串
						}, {
							"name": "吉安县" //三级选项 字符串
						}, {
							"name": "吉水县" //三级选项 字符串
						}, {
							"name": "峡江县" //三级选项 字符串
						}, {
							"name": "新干县" //三级选项 字符串
						}, {
							"name": "永丰县" //三级选项 字符串
						}, {
							"name": "泰和县" //三级选项 字符串
						}, {
							"name": "遂川县" //三级选项 字符串
						}, {
							"name": "万安县" //三级选项 字符串
						}, {
							"name": "安福县" //三级选项 字符串
						}, {
							"name": "永兴县" //三级选项 字符串
						},{
							"name": "井冈山市" //三级选项 字符串
						},
					]
				},{
					"name": "宜春", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "袁州区" //三级选项 字符串
						}, {
							"name": "奉新县" //三级选项 字符串
						}, {
							"name": "万载县" //三级选项 字符串
						}, {
							"name": "上高县" //三级选项 字符串
						}, {
							"name": "宜丰县" //三级选项 字符串
						}, {
							"name": "靖安县" //三级选项 字符串
						}, {
							"name": "铜鼓县" //三级选项 字符串
						}, {
							"name": "丰城市" //三级选项 字符串
						}, {
							"name": "樟树市" //三级选项 字符串
						}, {
							"name": "高安市" //三级选项 字符串
						},
					]
				},{
					"name": "抚州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "临川区" //三级选项 字符串
						}, {
							"name": "南城县" //三级选项 字符串
						}, {
							"name": "黎川县" //三级选项 字符串
						}, {
							"name": "南丰县" //三级选项 字符串
						}, {
							"name": "崇仁县" //三级选项 字符串
						}, {
							"name": "乐安县" //三级选项 字符串
						}, {
							"name": "宜黄县" //三级选项 字符串
						}, {
							"name": "金溪县" //三级选项 字符串
						}, {
							"name": "资溪县" //三级选项 字符串
						}, {
							"name": "东乡县" //三级选项 字符串
						}, {
							"name": "广昌县" //三级选项 字符串
						},
					]
				},{
					"name": "上饶", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "信州区" //三级选项 字符串
						}, {
							"name": "上饶县" //三级选项 字符串
						}, {
							"name": "广丰县" //三级选项 字符串
						}, {
							"name": "玉山县" //三级选项 字符串
						}, {
							"name": "铅山县" //三级选项 字符串
						}, {
							"name": "横峰县" //三级选项 字符串
						}, {
							"name": "戈阳县" //三级选项 字符串
						}, {
							"name": "余干县" //三级选项 字符串
						}, {
							"name": "鄱阳县" //三级选项 字符串
						}, {
							"name": "万年县" //三级选项 字符串
						}, {
							"name": "婺源县" //三级选项 字符串
						}, {
							"name": "德兴市" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "山东省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "济南", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "历下区" //三级选项 字符串
						}, {
							"name": "市中区" //三级选项 字符串
						}, {
							"name": "槐荫区" //三级选项 字符串
						}, {
							"name": "天桥区" //三级选项 字符串
						}, {
							"name": "历城区" //三级选项 字符串
						}, {
							"name": "长清区" //三级选项 字符串
						}, {
							"name": "平阴县" //三级选项 字符串
						}, {
							"name": "济阳县" //三级选项 字符串
						}, {
							"name": "商河县" //三级选项 字符串
						}, {
							"name": "章丘市" //三级选项 字符串
						},
					]
				},{
					"name": "青岛", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "市南区" //三级选项 字符串
						}, {
							"name": "市北区" //三级选项 字符串
						}, {
							"name": "四方区" //三级选项 字符串
						}, {
							"name": "黄岛区" //三级选项 字符串
						}, {
							"name": "崂山区" //三级选项 字符串
						}, {
							"name": "李沧区" //三级选项 字符串
						}, {
							"name": "城阳区" //三级选项 字符串
						}, {
							"name": "胶州市" //三级选项 字符串
						}, {
							"name": "即墨市" //三级选项 字符串
						}, {
							"name": "平度市" //三级选项 字符串
						}, {
							"name": "胶南市" //三级选项 字符串
						}, {
							"name": "莱西市" //三级选项 字符串
						},
					]
				},{
					"name": "淄博", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "淄川区" //三级选项 字符串
						}, {
							"name": "张店区" //三级选项 字符串
						}, {
							"name": "博山区" //三级选项 字符串
						}, {
							"name": "临淄区" //三级选项 字符串
						}, {
							"name": "周村区" //三级选项 字符串
						}, {
							"name": "桓台县" //三级选项 字符串
						}, {
							"name": "高青县" //三级选项 字符串
						}, {
							"name": "沂源县" //三级选项 字符串
						},
					]
				},{
					"name": "枣庄", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "市中区" //三级选项 字符串
						}, {
							"name": "薛城区" //三级选项 字符串
						}, {
							"name": "峄城区" //三级选项 字符串
						}, {
							"name": "台儿庄区" //三级选项 字符串
						}, {
							"name": "山亭区" //三级选项 字符串
						}, {
							"name": "滕州市" //三级选项 字符串
						},
					]
				},{
					"name": "东营区", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "河口区" //三级选项 字符串
						}, {
							"name": "垦利县" //三级选项 字符串
						}, {
							"name": "利津县" //三级选项 字符串
						}, {
							"name": "广饶县" //三级选项 字符串
						},
					]
				},{
					"name": "烟台", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "芝罘区" //三级选项 字符串
						}, {
							"name": "福山区" //三级选项 字符串
						}, {
							"name": "牟平区" //三级选项 字符串
						}, {
							"name": "莱山区" //三级选项 字符串
						}, {
							"name": "长岛县" //三级选项 字符串
						}, {
							"name": "龙口市" //三级选项 字符串
						}, {
							"name": "莱阳市" //三级选项 字符串
						}, {
							"name": "莱州市" //三级选项 字符串
						}, {
							"name": "蓬莱市" //三级选项 字符串
						}, {
							"name": "招远市" //三级选项 字符串
						}, {
							"name": "栖霞市" //三级选项 字符串
						}, {
							"name": "海阳市" //三级选项 字符串
						},
					]
				},{
					"name": "潍坊", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "潍城区" //三级选项 字符串
						}, {
							"name": "寒亭区" //三级选项 字符串
						}, {
							"name": "坊子区" //三级选项 字符串
						}, {
							"name": "奎文区" //三级选项 字符串
						}, {
							"name": "临朐县" //三级选项 字符串
						}, {
							"name": "昌乐县" //三级选项 字符串
						}, {
							"name": "诸城市" //三级选项 字符串
						}, {
							"name": "寿光市" //三级选项 字符串
						}, {
							"name": "安丘市" //三级选项 字符串
						}, {
							"name": "高密市" //三级选项 字符串
						}, {
							"name": "昌邑市" //三级选项 字符串
						},
					]
				},{
					"name": "济宁", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "市中区" //三级选项 字符串
						}, {
							"name": "任城区" //三级选项 字符串
						}, {
							"name": "微山县" //三级选项 字符串
						}, {
							"name": "鱼台县" //三级选项 字符串
						}, {
							"name": "金乡县" //三级选项 字符串
						}, {
							"name": "嘉祥县" //三级选项 字符串
						}, {
							"name": "汶上县" //三级选项 字符串
						}, {
							"name": "泗水县" //三级选项 字符串
						}, {
							"name": "梁山县" //三级选项 字符串
						}, {
							"name": "曲阜市" //三级选项 字符串
						}, {
							"name": "兖州市" //三级选项 字符串
						}, {
							"name": "邹城市" //三级选项 字符串
						},
					]
				},{
					"name": "泰安", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "泰山区" //三级选项 字符串
						}, {
							"name": "岱岳区" //三级选项 字符串
						}, {
							"name": "宁阳县" //三级选项 字符串
						}, {
							"name": "东平县" //三级选项 字符串
						}, {
							"name": "新泰市" //三级选项 字符串
						}, {
							"name": "肥城市" //三级选项 字符串
						},
					]
				},{
					"name": "威海", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "环翠区" //三级选项 字符串
						}, {
							"name": "文登市" //三级选项 字符串
						}, {
							"name": "荣成市" //三级选项 字符串
						}, {
							"name": "乳山市" //三级选项 字符串
						},
					]
				},{
					"name": "日照", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "东港区" //三级选项 字符串
						}, {
							"name": "岚山区" //三级选项 字符串
						}, {
							"name": "五莲县" //三级选项 字符串
						}, {
							"name": "莒县" //三级选项 字符串
						},
					]
				},{
					"name": "莱芜", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "莱城区" //三级选项 字符串
						}, {
							"name": "钢城区" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "临沂", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "兰山区" //三级选项 字符串
						}, {
							"name": "罗庄区" //三级选项 字符串
						}, {
							"name": "河东区" //三级选项 字符串
						}, {
							"name": "沂南县" //三级选项 字符串
						}, {
							"name": "郯城县" //三级选项 字符串
						}, {
							"name": "沂水县" //三级选项 字符串
						}, {
							"name": "苍山县" //三级选项 字符串
						}, {
							"name": "费县" //三级选项 字符串
						}, {
							"name": "平邑县" //三级选项 字符串
						}, {
							"name": "莒南县" //三级选项 字符串
						}, {
							"name": "蒙阴县" //三级选项 字符串
						}, {
							"name": "临沭县" //三级选项 字符串
						},
					]
				},{
					"name": "德州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "陵县" //三级选项 字符串
						}, {
							"name": "宁津县" //三级选项 字符串
						}, {
							"name": "庆云县" //三级选项 字符串
						}, {
							"name": "临邑县" //三级选项 字符串
						}, {
							"name": "齐河县" //三级选项 字符串
						}, {
							"name": "平原县" //三级选项 字符串
						}, {
							"name": "夏津县" //三级选项 字符串
						}, {
							"name": "武城县" //三级选项 字符串
						}, {
							"name": "乐陵市" //三级选项 字符串
						}, {
							"name": "禹城市" //三级选项 字符串
						},
					]
				},{
					"name": "聊城", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "东昌府区" //三级选项 字符串
						}, {
							"name": "阳谷县" //三级选项 字符串
						}, {
							"name": "莘县" //三级选项 字符串
						}, {
							"name": "茌平县" //三级选项 字符串
						}, {
							"name": "冠县" //三级选项 字符串
						}, {
							"name": "高唐县" //三级选项 字符串
						}, {
							"name": "临清市" //三级选项 字符串
						},
					]
				},{
					"name": "滨州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "滨城区" //三级选项 字符串
						}, {
							"name": "惠民县" //三级选项 字符串
						}, {
							"name": "阳信县" //三级选项 字符串
						}, {
							"name": "无棣县" //三级选项 字符串
						}, {
							"name": "沾化县" //三级选项 字符串
						}, {
							"name": "博兴县" //三级选项 字符串
						}, {
							"name": "邹平县" //三级选项 字符串
						},
					]
				},{
					"name": "菏泽", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "牡丹区" //三级选项 字符串
						}, {
							"name": "曹县" //三级选项 字符串
						}, {
							"name": "单县" //三级选项 字符串
						}, {
							"name": "成武县" //三级选项 字符串
						}, {
							"name": "巨野县" //三级选项 字符串
						}, {
							"name": "郓城县" //三级选项 字符串
						}, {
							"name": "鄄城县" //三级选项 字符串
						}, {
							"name": "定陶县" //三级选项 字符串
						}, {
							"name": "东明县" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "河南省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "郑州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "中原区" //三级选项 字符串
						}, {
							"name": "二七区" //三级选项 字符串
						}, {
							"name": "管城回族区" //三级选项 字符串
						}, {
							"name": "金水区" //三级选项 字符串
						}, {
							"name": "上街区" //三级选项 字符串
						}, {
							"name": "惠济区" //三级选项 字符串
						}, {
							"name": "中牟县" //三级选项 字符串
						}, {
							"name": "巩义市" //三级选项 字符串
						}, {
							"name": "荥阳市" //三级选项 字符串
						}, {
							"name": "新密市" //三级选项 字符串
						}, {
							"name": "新郑市" //三级选项 字符串
						}, {
							"name": "登封市" //三级选项 字符串
						},
					]
				},{
					"name": "开封", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "龙亭区" //三级选项 字符串
						}, {
							"name": "顺河回族区" //三级选项 字符串
						}, {
							"name": "鼓楼区" //三级选项 字符串
						}, {
							"name": "禹王台区" //三级选项 字符串
						}, {
							"name": "金明区" //三级选项 字符串
						}, {
							"name": "杞县" //三级选项 字符串
						}, {
							"name": "通许县" //三级选项 字符串
						}, {
							"name": "尉氏县" //三级选项 字符串
						}, {
							"name": "开封县" //三级选项 字符串
						}, {
							"name": "兰考县" //三级选项 字符串
						},
					]
				},{
					"name": "洛阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "老城区" //三级选项 字符串
						}, {
							"name": "西工区" //三级选项 字符串
						}, {
							"name": "瀍河回族区" //三级选项 字符串
						}, {
							"name": "涧西区" //三级选项 字符串
						}, {
							"name": "吉利区" //三级选项 字符串
						}, {
							"name": "洛龙区" //三级选项 字符串
						}, {
							"name": "孟津县" //三级选项 字符串
						}, {
							"name": "新安县" //三级选项 字符串
						}, {
							"name": "栾川县" //三级选项 字符串
						}, {
							"name": "嵩县" //三级选项 字符串
						}, {
							"name": "汝阳县" //三级选项 字符串
						}, {
							"name": "宜阳县" //三级选项 字符串
						}, {
							"name": "洛宁县" //三级选项 字符串
						}, {
							"name": "伊川县" //三级选项 字符串
						}, {
							"name": "偃师县" //三级选项 字符串
						},
					]
				},{
					"name": "平顶山", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "新华区" //三级选项 字符串
						}, {
							"name": "卫东区" //三级选项 字符串
						}, {
							"name": "石龙区" //三级选项 字符串
						}, {
							"name": "湛河区" //三级选项 字符串
						}, {
							"name": "宝丰县" //三级选项 字符串
						}, {
							"name": "叶县" //三级选项 字符串
						}, {
							"name": "鲁山县" //三级选项 字符串
						}, {
							"name": "郏县" //三级选项 字符串
						}, {
							"name": "舞钢市" //三级选项 字符串
						}, {
							"name": "汝州市" //三级选项 字符串
						},
					]
				},{
					"name": "安阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "文峰区" //三级选项 字符串
						}, {
							"name": "北关区" //三级选项 字符串
						}, {
							"name": "殷都区" //三级选项 字符串
						}, {
							"name": "龙安区" //三级选项 字符串
						}, {
							"name": "安阳县" //三级选项 字符串
						}, {
							"name": "汤阴县" //三级选项 字符串
						}, {
							"name": "滑县" //三级选项 字符串
						}, {
							"name": "内黄县" //三级选项 字符串
						}, {
							"name": "林州市" //三级选项 字符串
						},
					]
				},{
					"name": "鹤壁", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "鹤山区" //三级选项 字符串
						}, {
							"name": "山城区" //三级选项 字符串
						}, {
							"name": "淇滨区" //三级选项 字符串
						}, {
							"name": "浚县" //三级选项 字符串
						}, {
							"name": "淇县" //三级选项 字符串
						},
					]
				},{
					"name": "新乡", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "红旗区" //三级选项 字符串
						}, {
							"name": "卫滨区" //三级选项 字符串
						}, {
							"name": "凤泉区" //三级选项 字符串
						}, {
							"name": "牧野区" //三级选项 字符串
						}, {
							"name": "新乡县" //三级选项 字符串
						}, {
							"name": "获嘉县" //三级选项 字符串
						}, {
							"name": "原阳县" //三级选项 字符串
						}, {
							"name": "延津县" //三级选项 字符串
						}, {
							"name": "封丘县" //三级选项 字符串
						}, {
							"name": "长垣县" //三级选项 字符串
						}, {
							"name": "卫辉市" //三级选项 字符串
						}, {
							"name": "辉县市" //三级选项 字符串
						},
					]
				},{
					"name": "焦作", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "解放区" //三级选项 字符串
						}, {
							"name": "中站区" //三级选项 字符串
						}, {
							"name": "马村区" //三级选项 字符串
						}, {
							"name": "山阳区" //三级选项 字符串
						}, {
							"name": "修武县" //三级选项 字符串
						}, {
							"name": "博爱县" //三级选项 字符串
						}, {
							"name": "武陟县" //三级选项 字符串
						}, {
							"name": "温县" //三级选项 字符串
						}, {
							"name": "沁阳市" //三级选项 字符串
						}, {
							"name": "孟州市" //三级选项 字符串
						},
					]
				},{
					"name": "濮阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "华龙区" //三级选项 字符串
						}, {
							"name": "清丰县" //三级选项 字符串
						}, {
							"name": "南乐县" //三级选项 字符串
						}, {
							"name": "范县" //三级选项 字符串
						}, {
							"name": "台前县" //三级选项 字符串
						}, {
							"name": "濮阳县" //三级选项 字符串
						},
					]
				},{
					"name": "许昌", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "魏都区" //三级选项 字符串
						}, {
							"name": "许昌县" //三级选项 字符串
						}, {
							"name": "鄢陵县" //三级选项 字符串
						}, {
							"name": "襄城县" //三级选项 字符串
						}, {
							"name": "禹州市" //三级选项 字符串
						}, {
							"name": "长葛市" //三级选项 字符串
						},
					]
				},{
					"name": "漯河", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "源汇区" //三级选项 字符串
						}, {
							"name": "郾城区" //三级选项 字符串
						}, {
							"name": "召陵区" //三级选项 字符串
						}, {
							"name": "舞阳县" //三级选项 字符串
						}, {
							"name": "临颍县" //三级选项 字符串
						},
					]
				},{
					"name": "三门峡", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "湖滨区" //三级选项 字符串
						}, {
							"name": "渑池县" //三级选项 字符串
						}, {
							"name": "陕县" //三级选项 字符串
						}, {
							"name": "卢氏县" //三级选项 字符串
						}, {
							"name": "义马市" //三级选项 字符串
						}, {
							"name": "灵宝市" //三级选项 字符串
						},
					]
				},{
					"name": "南阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "宛城区" //三级选项 字符串
						}, {
							"name": "卧龙区" //三级选项 字符串
						}, {
							"name": "南召县" //三级选项 字符串
						}, {
							"name": "方城县" //三级选项 字符串
						}, {
							"name": "西峡县" //三级选项 字符串
						}, {
							"name": "镇平县" //三级选项 字符串
						}, {
							"name": "内乡县" //三级选项 字符串
						}, {
							"name": "淅川县" //三级选项 字符串
						}, {
							"name": "社旗县" //三级选项 字符串
						}, {
							"name": "唐河县" //三级选项 字符串
						}, {
							"name": "新野县" //三级选项 字符串
						}, {
							"name": "桐柏县" //三级选项 字符串
						},{
							"name": "邓州市" //三级选项 字符串
						},
					]
				},{
					"name": "商丘", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "梁园区" //三级选项 字符串
						}, {
							"name": "睢阳区" //三级选项 字符串
						}, {
							"name": "民权县" //三级选项 字符串
						}, {
							"name": "睢县" //三级选项 字符串
						}, {
							"name": "宁陵县" //三级选项 字符串
						}, {
							"name": "柘城县" //三级选项 字符串
						}, {
							"name": "虞城县" //三级选项 字符串
						}, {
							"name": "夏邑县" //三级选项 字符串
						}, {
							"name": "永城市" //三级选项 字符串
						},
					]
				},{
					"name": "信阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "浉河区" //三级选项 字符串
						}, {
							"name": "平桥区" //三级选项 字符串
						}, {
							"name": "罗山县" //三级选项 字符串
						}, {
							"name": "光山县" //三级选项 字符串
						}, {
							"name": "新县" //三级选项 字符串
						}, {
							"name": "商城县" //三级选项 字符串
						}, {
							"name": "固始县" //三级选项 字符串
						}, {
							"name": "潢川县" //三级选项 字符串
						}, {
							"name": "淮滨县" //三级选项 字符串
						}, {
							"name": "息县" //三级选项 字符串
						},
					]
				},{
					"name": "周口", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "川汇区" //三级选项 字符串
						}, {
							"name": "扶沟县" //三级选项 字符串
						}, {
							"name": "西华县" //三级选项 字符串
						}, {
							"name": "商水县" //三级选项 字符串
						}, {
							"name": "沈丘县" //三级选项 字符串
						}, {
							"name": "郸城县" //三级选项 字符串
						}, {
							"name": "淮阳县" //三级选项 字符串
						}, {
							"name": "太康县" //三级选项 字符串
						}, {
							"name": "鹿邑县" //三级选项 字符串
						}, {
							"name": "项城市" //三级选项 字符串
						},
					]
				},{
					"name": "驻马店", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "驿城区" //三级选项 字符串
						}, {
							"name": "西平县" //三级选项 字符串
						}, {
							"name": "上蔡县" //三级选项 字符串
						}, {
							"name": "平舆县" //三级选项 字符串
						}, {
							"name": "正阳县" //三级选项 字符串
						}, {
							"name": "确山县" //三级选项 字符串
						}, {
							"name": "沁阳县" //三级选项 字符串
						}, {
							"name": "汝南县" //三级选项 字符串
						}, {
							"name": "遂平县" //三级选项 字符串
						}, {
							"name": "新蔡县" //三级选项 字符串
						},
					]
				},{
					"name": "济源", //二级选项 字符串
				},
			]
		}, {
			"name": "湖北省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "武汉", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "江岸区" //三级选项 字符串
						}, {
							"name": "江干区" //三级选项 字符串
						}, {
							"name": "硚口区" //三级选项 字符串
						}, {
							"name": "汉阳区" //三级选项 字符串
						}, {
							"name": "武昌区" //三级选项 字符串
						}, {
							"name": "青山区" //三级选项 字符串
						}, {
							"name": "洪山区" //三级选项 字符串
						}, {
							"name": "东西湖区" //三级选项 字符串
						}, {
							"name": "汉南区" //三级选项 字符串
						}, {
							"name": "蔡甸区" //三级选项 字符串
						}, {
							"name": "江夏区" //三级选项 字符串
						}, {
							"name": "黄陂区" //三级选项 字符串
						},{
							"name": "新洲区" //三级选项 字符串
						},
					]
				},{
					"name": "黄石", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "黄石港区" //三级选项 字符串
						}, {
							"name": "西塞山区" //三级选项 字符串
						}, {
							"name": "下陆区" //三级选项 字符串
						}, {
							"name": "铁山区" //三级选项 字符串
						}, {
							"name": "铁山区" //三级选项 字符串
						}, {
							"name": "阳新县" //三级选项 字符串
						}, {
							"name": "大冶市" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "十堰", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "茅箭区" //三级选项 字符串
						}, {
							"name": "张湾区" //三级选项 字符串
						}, {
							"name": "郧县" //三级选项 字符串
						}, {
							"name": "郧西县" //三级选项 字符串
						}, {
							"name": "竹山县" //三级选项 字符串
						}, {
							"name": "竹溪县" //三级选项 字符串
						}, {
							"name": "房县" //三级选项 字符串
						}, {
							"name": "丹江口市" //三级选项 字符串
						},
					]
				},{
					"name": "宜昌", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "西陵区" //三级选项 字符串
						}, {
							"name": "伍家岗区" //三级选项 字符串
						}, {
							"name": "点军区" //三级选项 字符串
						}, {
							"name": "猇亭区" //三级选项 字符串
						}, {
							"name": "夷陵区" //三级选项 字符串
						}, {
							"name": "远安县" //三级选项 字符串
						}, {
							"name": "兴山县" //三级选项 字符串
						}, {
							"name": "秭归县" //三级选项 字符串
						}, {
							"name": "长阳土家则自治县" //三级选项 字符串
						}, {
							"name": "五峰土家族自治县" //三级选项 字符串
						}, {
							"name": "宜都市" //三级选项 字符串
						}, {
							"name": "当阳市" //三级选项 字符串
						},{
							"name": "枝江市" //三级选项 字符串
						},
					]
				},{
					"name": "襄阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "襄城区" //三级选项 字符串
						}, {
							"name": "樊城区" //三级选项 字符串
						}, {
							"name": "襄州区" //三级选项 字符串
						}, {
							"name": "南漳县" //三级选项 字符串
						}, {
							"name": "谷城县" //三级选项 字符串
						}, {
							"name": "保康县" //三级选项 字符串
						}, {
							"name": "老河口市" //三级选项 字符串
						}, {
							"name": "枣阳市" //三级选项 字符串
						}, {
							"name": "宜城市" //三级选项 字符串
						},
					]
				},{
					"name": "鄂州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "梁子湖区" //三级选项 字符串
						}, {
							"name": "华容区" //三级选项 字符串
						}, {
							"name": "鄂城区" //三级选项 字符串
						},
					]
				},{
					"name": "荆门", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "东宝区" //三级选项 字符串
						}, {
							"name": "掇刀区" //三级选项 字符串
						}, {
							"name": "京山县" //三级选项 字符串
						}, {
							"name": "沙洋县" //三级选项 字符串
						}, {
							"name": "钟祥市" //三级选项 字符串
						},
					]
				},{
					"name": "孝感", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "孝南区" //三级选项 字符串
						}, {
							"name": "孝昌县" //三级选项 字符串
						}, {
							"name": "大悟县" //三级选项 字符串
						}, {
							"name": "云梦县" //三级选项 字符串
						}, {
							"name": "应城市" //三级选项 字符串
						}, {
							"name": "安陆市" //三级选项 字符串
						}, {
							"name": "汉川市" //三级选项 字符串
						},
					]
				},{
					"name": "荆州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "沙市区" //三级选项 字符串
						}, {
							"name": "荆州区" //三级选项 字符串
						}, {
							"name": "公安县" //三级选项 字符串
						}, {
							"name": "监利县" //三级选项 字符串
						}, {
							"name": "江陵县" //三级选项 字符串
						}, {
							"name": "石首市" //三级选项 字符串
						}, {
							"name": "洪湖市" //三级选项 字符串
						}, {
							"name": "松滋市" //三级选项 字符串
						},
					]
				},{
					"name": "黄冈", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "黄州区" //三级选项 字符串
						}, {
							"name": "团风县" //三级选项 字符串
						}, {
							"name": "红安县" //三级选项 字符串
						}, {
							"name": "罗田县" //三级选项 字符串
						}, {
							"name": "英山县" //三级选项 字符串
						}, {
							"name": "浠水县" //三级选项 字符串
						}, {
							"name": "蕲春县" //三级选项 字符串
						}, {
							"name": "黄梅县" //三级选项 字符串
						}, {
							"name": "麻城市" //三级选项 字符串
						}, {
							"name": "武穴市" //三级选项 字符串
						},
					]
				},{
					"name": "咸宁", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "咸安区" //三级选项 字符串
						}, {
							"name": "嘉鱼县" //三级选项 字符串
						}, {
							"name": "通城县" //三级选项 字符串
						}, {
							"name": "崇阳县" //三级选项 字符串
						}, {
							"name": "通山县" //三级选项 字符串
						}, {
							"name": "赤壁市" //三级选项 字符串
						},
					]
				},{
					"name": "随州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "曾都区" //三级选项 字符串
						}, {
							"name": "随县" //三级选项 字符串
						}, {
							"name": "广水市" //三级选项 字符串
						},
					]
				},{
					"name": "恩施", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "恩施市" //三级选项 字符串
						}, {
							"name": "利川市" //三级选项 字符串
						}, {
							"name": "建始县" //三级选项 字符串
						}, {
							"name": "巴东县" //三级选项 字符串
						}, {
							"name": "宣恩县" //三级选项 字符串
						}, {
							"name": "咸丰县" //三级选项 字符串
						}, {
							"name": "来凤县" //三级选项 字符串
						}, {
							"name": "鹤峰县" //三级选项 字符串
						},
					]
				},{
					"name": "仙桃", //二级选项 字符串
				},{
					"name": "潜江", //二级选项 字符串
				},{
					"name": "天门", //二级选项 字符串
				},{
					"name": "神农架", //二级选项 字符串
				}
			]
		}, {
			"name": "湖南省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "长沙", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "芙蓉区" //三级选项 字符串
						}, {
							"name": "天心区" //三级选项 字符串
						}, {
							"name": "岳麓区" //三级选项 字符串
						}, {
							"name": "开福区" //三级选项 字符串
						}, {
							"name": "雨花区" //三级选项 字符串
						}, {
							"name": "长沙县" //三级选项 字符串
						}, {
							"name": "望城县" //三级选项 字符串
						}, {
							"name": "宁乡县" //三级选项 字符串
						}, {
							"name": "浏阳市" //三级选项 字符串
						},
					]
				},{
					"name": "株洲", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "荷塘区" //三级选项 字符串
						}, {
							"name": "芦淞区" //三级选项 字符串
						}, {
							"name": "石峰区" //三级选项 字符串
						}, {
							"name": "天元区" //三级选项 字符串
						}, {
							"name": "株洲县" //三级选项 字符串
						}, {
							"name": "攸县" //三级选项 字符串
						}, {
							"name": "茶陵县" //三级选项 字符串
						}, {
							"name": "炎陵县" //三级选项 字符串
						}, {
							"name": "醴陵市" //三级选项 字符串
						},
					]
				},{
					"name": "湘潭", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "雨湖区" //三级选项 字符串
						}, {
							"name": "岳塘区" //三级选项 字符串
						}, {
							"name": "湘潭县" //三级选项 字符串
						}, {
							"name": "湘乡市" //三级选项 字符串
						}, {
							"name": "韶山市" //三级选项 字符串
						},
					]
				},{
					"name": "衡阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "珠晖区" //三级选项 字符串
						}, {
							"name": "雁峰区" //三级选项 字符串
						}, {
							"name": "石鼓区" //三级选项 字符串
						}, {
							"name": "蒸湘区" //三级选项 字符串
						}, {
							"name": "南岳区" //三级选项 字符串
						}, {
							"name": "衡阳县" //三级选项 字符串
						}, {
							"name": "衡南县" //三级选项 字符串
						}, {
							"name": "衡山县" //三级选项 字符串
						}, {
							"name": "衡东县" //三级选项 字符串
						}, {
							"name": "祁东县" //三级选项 字符串
						}, {
							"name": "耒阳市" //三级选项 字符串
						}, {
							"name": "常宁市" //三级选项 字符串
						},
					]
				},{
					"name": "邵阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "双清区" //三级选项 字符串
						}, {
							"name": "大祥区" //三级选项 字符串
						}, {
							"name": "北塔区" //三级选项 字符串
						}, {
							"name": "邵东县" //三级选项 字符串
						}, {
							"name": "新邵县" //三级选项 字符串
						}, {
							"name": "邵阳县" //三级选项 字符串
						}, {
							"name": "隆回县" //三级选项 字符串
						}, {
							"name": "洞口县" //三级选项 字符串
						}, {
							"name": "绥宁县" //三级选项 字符串
						}, {
							"name": "新宁县" //三级选项 字符串
						}, {
							"name": "城步苗族自治县" //三级选项 字符串
						}, {
							"name": "武冈市" //三级选项 字符串
						},
					]
				},{
					"name": "岳阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "岳阳楼区" //三级选项 字符串
						}, {
							"name": "云溪区" //三级选项 字符串
						}, {
							"name": "君山区" //三级选项 字符串
						}, {
							"name": "岳阳县" //三级选项 字符串
						}, {
							"name": "华容县" //三级选项 字符串
						}, {
							"name": "湘阴县" //三级选项 字符串
						}, {
							"name": "平江县" //三级选项 字符串
						}, {
							"name": "汨罗市" //三级选项 字符串
						}, {
							"name": "临湘市" //三级选项 字符串
						},
					]
				},{
					"name": "常德", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "武陵区" //三级选项 字符串
						}, {
							"name": "鼎城区" //三级选项 字符串
						}, {
							"name": "安乡县" //三级选项 字符串
						}, {
							"name": "汉寿县" //三级选项 字符串
						}, {
							"name": "澧县" //三级选项 字符串
						}, {
							"name": "临澧县" //三级选项 字符串
						}, {
							"name": "桃源县" //三级选项 字符串
						}, {
							"name": "石门县" //三级选项 字符串
						}, {
							"name": "津市市" //三级选项 字符串
						},
					]
				},{
					"name": "张家界", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "永定区" //三级选项 字符串
						}, {
							"name": "武陵源区" //三级选项 字符串
						}, {
							"name": "慈利县" //三级选项 字符串
						}, {
							"name": "桑植县" //三级选项 字符串
						},
					]
				},{
					"name": "益阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "资阳区" //三级选项 字符串
						}, {
							"name": "赫山区" //三级选项 字符串
						}, {
							"name": "南山" //三级选项 字符串
						}, {
							"name": "桃江县" //三级选项 字符串
						}, {
							"name": "安化县" //三级选项 字符串
						}, {
							"name": "沅江市" //三级选项 字符串
						},
					]
				},{
					"name": "郴州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "北湖区" //三级选项 字符串
						}, {
							"name": "苏仙区" //三级选项 字符串
						}, {
							"name": "桂阳县" //三级选项 字符串
						}, {
							"name": "宜章县" //三级选项 字符串
						}, {
							"name": "永兴县" //三级选项 字符串
						}, {
							"name": "嘉禾县" //三级选项 字符串
						}, {
							"name": "临武县" //三级选项 字符串
						}, {
							"name": "汝城县" //三级选项 字符串
						}, {
							"name": "桂东县" //三级选项 字符串
						}, {
							"name": "安仁县" //三级选项 字符串
						}, {
							"name": "资兴市" //三级选项 字符串
						},
					]
				},{
					"name": "永州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "零陵区" //三级选项 字符串
						}, {
							"name": "冷水滩区" //三级选项 字符串
						}, {
							"name": "祁阳县" //三级选项 字符串
						}, {
							"name": "东安县" //三级选项 字符串
						}, {
							"name": "双牌县" //三级选项 字符串
						}, {
							"name": "道县" //三级选项 字符串
						}, {
							"name": "江永县" //三级选项 字符串
						}, {
							"name": "宁远县" //三级选项 字符串
						}, {
							"name": "蓝山县" //三级选项 字符串
						}, {
							"name": "新田县" //三级选项 字符串
						}, {
							"name": "江华瑶族自治县" //三级选项 字符串
						},
					]
				},{
					"name": "怀化", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "鹤城区" //三级选项 字符串
						}, {
							"name": "中方县" //三级选项 字符串
						}, {
							"name": "沅陵县" //三级选项 字符串
						}, {
							"name": "辰溪县" //三级选项 字符串
						}, {
							"name": "溆浦县" //三级选项 字符串
						}, {
							"name": "会同县" //三级选项 字符串
						}, {
							"name": "麻阳苗族自治县" //三级选项 字符串
						}, {
							"name": "新晃侗族自治县" //三级选项 字符串
						}, {
							"name": "芷江侗族自治县" //三级选项 字符串
						}, {
							"name": "靖州苗族自治县" //三级选项 字符串
						}, {
							"name": "通道侗族自治县" //三级选项 字符串
						}, {
							"name": "洪江市" //三级选项 字符串
						},
					]
				},{
					"name": "娄底", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "娄星区" //三级选项 字符串
						}, {
							"name": "双峰县" //三级选项 字符串
						}, {
							"name": "新化县" //三级选项 字符串
						}, {
							"name": "冷水江市" //三级选项 字符串
						},
					]
				},{
					"name": "湘西", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "吉首市" //三级选项 字符串
						}, {
							"name": "泸溪县" //三级选项 字符串
						}, {
							"name": "凤凰县" //三级选项 字符串
						}, {
							"name": "花垣县" //三级选项 字符串
						}, {
							"name": "保靖县" //三级选项 字符串
						}, {
							"name": "古丈县" //三级选项 字符串
						}, {
							"name": "永顺县" //三级选项 字符串
						}, {
							"name": "龙山县" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "广东省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "广州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "荔湾区" //三级选项 字符串
						}, {
							"name": "越秀区" //三级选项 字符串
						}, {
							"name": "海珠区" //三级选项 字符串
						}, {
							"name": "天河区" //三级选项 字符串
						}, {
							"name": "白云区" //三级选项 字符串
						}, {
							"name": "黄埔区" //三级选项 字符串
						}, {
							"name": "番禺区" //三级选项 字符串
						}, {
							"name": "花都区" //三级选项 字符串
						}, {
							"name": "南沙区" //三级选项 字符串
						}, {
							"name": "萝岗区" //三级选项 字符串
						}, {
							"name": "增城市" //三级选项 字符串
						}, {
							"name": "从化市" //三级选项 字符串
						},
					]
				},{
					"name": "韶关", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "武江区" //三级选项 字符串
						}, {
							"name": "浈江区" //三级选项 字符串
						}, {
							"name": "曲江区" //三级选项 字符串
						}, {
							"name": "始兴县" //三级选项 字符串
						}, {
							"name": "仁化县" //三级选项 字符串
						}, {
							"name": "翁源县" //三级选项 字符串
						}, {
							"name": "乳源瑶族自治县" //三级选项 字符串
						}, {
							"name": "新丰县" //三级选项 字符串
						}, {
							"name": "乐昌县" //三级选项 字符串
						}, {
							"name": "南雄市" //三级选项 字符串
						},
					]
				},{
					"name": "深圳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "罗湖区" //三级选项 字符串
						}, {
							"name": "福田区" //三级选项 字符串
						}, {
							"name": "南山区" //三级选项 字符串
						}, {
							"name": "宝安区" //三级选项 字符串
						}, {
							"name": "龙岗区" //三级选项 字符串
						}, {
							"name": "盐田区" //三级选项 字符串
						},
					]
				},{
					"name": "珠海", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "香洲区" //三级选项 字符串
						}, {
							"name": "斗门区" //三级选项 字符串
						}, {
							"name": "金湾区" //三级选项 字符串
						},
					]
				},{
					"name": "汕头", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "龙湖区" //三级选项 字符串
						}, {
							"name": "金平区" //三级选项 字符串
						}, {
							"name": "濠江区" //三级选项 字符串
						}, {
							"name": "潮阳区" //三级选项 字符串
						}, {
							"name": "潮南区" //三级选项 字符串
						}, {
							"name": "澄海区" //三级选项 字符串
						}, {
							"name": "南澳县" //三级选项 字符串
						},
					]
				},{
					"name": "佛山", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "禅城区" //三级选项 字符串
						}, {
							"name": "南海区" //三级选项 字符串
						}, {
							"name": "顺德区" //三级选项 字符串
						}, {
							"name": "三水区" //三级选项 字符串
						}, {
							"name": "高明区" //三级选项 字符串
						},
					]
				},{
					"name": "江门", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "蓬江区" //三级选项 字符串
						}, {
							"name": "江海区" //三级选项 字符串
						}, {
							"name": "新会区" //三级选项 字符串
						}, {
							"name": "台山市" //三级选项 字符串
						}, {
							"name": "开平市" //三级选项 字符串
						}, {
							"name": "鹤山市" //三级选项 字符串
						}, {
							"name": "恩平市" //三级选项 字符串
						},
					]
				},{
					"name": "湛江", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "茂名" //三级选项 字符串
						}, {
							"name": "赤坎区" //三级选项 字符串
						}, {
							"name": "霞山区" //三级选项 字符串
						}, {
							"name": "坡头区" //三级选项 字符串
						}, {
							"name": "麻章区" //三级选项 字符串
						}, {
							"name": "遂溪县" //三级选项 字符串
						}, {
							"name": "徐闻县" //三级选项 字符串
						}, {
							"name": "廉江市" //三级选项 字符串
						}, {
							"name": "雷州市" //三级选项 字符串
						}, {
							"name": "吴川市" //三级选项 字符串
						},
					]
				},{
					"name": "茂名", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "茂南区" //三级选项 字符串
						}, {
							"name": "茂港区" //三级选项 字符串
						}, {
							"name": "电白县" //三级选项 字符串
						}, {
							"name": "高州市" //三级选项 字符串
						}, {
							"name": "化州市" //三级选项 字符串
						}, {
							"name": "信宜市" //三级选项 字符串
						},
					]
				},{
					"name": "肇庆", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "端州区" //三级选项 字符串
						}, {
							"name": "鼎湖区" //三级选项 字符串
						}, {
							"name": "广宁县" //三级选项 字符串
						}, {
							"name": "怀集县" //三级选项 字符串
						}, {
							"name": "封开县" //三级选项 字符串
						}, {
							"name": "德庆县" //三级选项 字符串
						}, {
							"name": "高要市" //三级选项 字符串
						}, {
							"name": "四会市" //三级选项 字符串
						},
					]
				},{
					"name": "惠州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "惠城区" //三级选项 字符串
						}, {
							"name": "惠阳区" //三级选项 字符串
						}, {
							"name": "博罗县" //三级选项 字符串
						}, {
							"name": "惠东县" //三级选项 字符串
						}, {
							"name": "龙门县" //三级选项 字符串
						},
					]
				},{
					"name": "梅州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "梅江区" //三级选项 字符串
						}, {
							"name": "梅县" //三级选项 字符串
						}, {
							"name": "大埔县" //三级选项 字符串
						}, {
							"name": "丰顺县" //三级选项 字符串
						}, {
							"name": "五华县" //三级选项 字符串
						}, {
							"name": "平远县" //三级选项 字符串
						}, {
							"name": "蕉岭县" //三级选项 字符串
						},
					]
				},{
					"name": "汕尾", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "城区" //三级选项 字符串
						}, {
							"name": "海丰县" //三级选项 字符串
						}, {
							"name": "陆河县" //三级选项 字符串
						}, {
							"name": "陆丰市" //三级选项 字符串
						},
					]
				},{
					"name": "河源", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "源城区" //三级选项 字符串
						}, {
							"name": "紫金县" //三级选项 字符串
						}, {
							"name": "龙川县" //三级选项 字符串
						}, {
							"name": "连平县" //三级选项 字符串
						}, {
							"name": "和平县" //三级选项 字符串
						}, {
							"name": "东源县" //三级选项 字符串
						},
					]
				},{
					"name": "阳江", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "江城区" //三级选项 字符串
						}, {
							"name": "阳西县" //三级选项 字符串
						}, {
							"name": "阳东县" //三级选项 字符串
						}, {
							"name": "阳春市" //三级选项 字符串
						},
					]
				},{
					"name": "清远", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "清城区" //三级选项 字符串
						}, {
							"name": "佛冈县" //三级选项 字符串
						}, {
							"name": "阳山县" //三级选项 字符串
						}, {
							"name": "连山壮族瑶族自治县" //三级选项 字符串
						}, {
							"name": "连南瑶族自治县" //三级选项 字符串
						}, {
							"name": "清新县" //三级选项 字符串
						}, {
							"name": "英德市" //三级选项 字符串
						}, {
							"name": "连州市" //三级选项 字符串
						},
					]
				},{
					"name": "东莞", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "东莞市" //三级选项 字符串
						},
					]
				},{
					"name": "中山", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "中山市" //三级选项 字符串
						},
					]
				},{
					"name": "潮州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "湘桥区" //三级选项 字符串
						}, {
							"name": "潮安县" //三级选项 字符串
						}, {
							"name": "饶平县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "揭阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "榕城区" //三级选项 字符串
						}, {
							"name": "揭东县" //三级选项 字符串
						}, {
							"name": "揭西县" //三级选项 字符串
						}, {
							"name": "惠来县" //三级选项 字符串
						}, {
							"name": "普宁市" //三级选项 字符串
						},
					]
				},{
					"name": "云浮", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "云城区" //三级选项 字符串
						}, {
							"name": "新兴县" //三级选项 字符串
						}, {
							"name": "郁南县" //三级选项 字符串
						}, {
							"name": "云安县" //三级选项 字符串
						}, {
							"name": "罗定市" //三级选项 字符串
						},
					]
				}
			]
		}, {
			"name": "海南省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "海口", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "秀英区" //三级选项 字符串
						}, {
							"name": "龙华区" //三级选项 字符串
						}, {
							"name": "琼山区" //三级选项 字符串
						}, {
							"name": "美兰区" //三级选项 字符串
						},
					]
				},{
					"name": "三亚", //二级选项 字符串
				},{
					"name": "三沙", //二级选项 字符串
				},{
					"name": "五指山", //二级选项 字符串
				},{
					"name": "琼海", //二级选项 字符串
				},{
					"name": "儋州", //二级选项 字符串
				},{
					"name": "文昌", //二级选项 字符串
				},{
					"name": "万宁", //二级选项 字符串
				},{
					"name": "东方", //二级选项 字符串
				},{
					"name": "定安", //二级选项 字符串
				},{
					"name": "屯昌", //二级选项 字符串
				},{
					"name": "澄迈", //二级选项 字符串
				},{
					"name": "临高", //二级选项 字符串
				},{
					"name": "白沙", //二级选项 字符串
				},{
					"name": "昌江", //二级选项 字符串
				},{
					"name": "乐东", //二级选项 字符串
				},{
					"name": "陵水", //二级选项 字符串
				},{
					"name": "保亭", //二级选项 字符串
				},{
					"name": "琼中", //二级选项 字符串
				},
			]
		}, {
			"name": "四川省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "成都", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "锦江区" //三级选项 字符串
						}, {
							"name": "青羊区" //三级选项 字符串
						}, {
							"name": "金牛区" //三级选项 字符串
						}, {
							"name": "武侯区" //三级选项 字符串
						}, {
							"name": "成华区" //三级选项 字符串
						}, {
							"name": "龙泉驿区" //三级选项 字符串
						}, {
							"name": "青白江区" //三级选项 字符串
						}, {
							"name": "新都区" //三级选项 字符串
						}, {
							"name": "温江区" //三级选项 字符串
						}, {
							"name": "金堂县" //三级选项 字符串
						}, {
							"name": "双流县" //三级选项 字符串
						}, {
							"name": "郫县" //三级选项 字符串
						}, {
							"name": "大邑县" //三级选项 字符串
						}, {
							"name": "浦江县" //三级选项 字符串
						}, {
							"name": "新津县" //三级选项 字符串
						}, {
							"name": "都江堰市" //三级选项 字符串
						}, {
							"name": "彭州市" //三级选项 字符串
						}, {
							"name": "邛崃市" //三级选项 字符串
						}, {
							"name": "崇州市" //三级选项 字符串
						},
					]
				},{
					"name": "自贡", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "自流井区" //三级选项 字符串
						}, {
							"name": "大安区" //三级选项 字符串
						}, {
							"name": "沿滩区" //三级选项 字符串
						}, {
							"name": "荣县" //三级选项 字符串
						}, {
							"name": "富顺县" //三级选项 字符串
						},
					]
				},{
					"name": "攀枝花", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "东区" //三级选项 字符串
						}, {
							"name": "西区" //三级选项 字符串
						}, {
							"name": "仁和区" //三级选项 字符串
						}, {
							"name": "米易县" //三级选项 字符串
						}, {
							"name": "盐边县" //三级选项 字符串
						},
					]
				},{
					"name": "泸州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "江阳区" //三级选项 字符串
						}, {
							"name": "纳溪区" //三级选项 字符串
						}, {
							"name": "龙马潭区" //三级选项 字符串
						}, {
							"name": "泸县" //三级选项 字符串
						}, {
							"name": "合江县" //三级选项 字符串
						}, {
							"name": "叙永县" //三级选项 字符串
						}, {
							"name": "古蔺县" //三级选项 字符串
						},
					]
				},{
					"name": "德阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "旌阳区" //三级选项 字符串
						}, {
							"name": "中江县" //三级选项 字符串
						}, {
							"name": "罗江县" //三级选项 字符串
						}, {
							"name": "广汉市" //三级选项 字符串
						}, {
							"name": "什邡市" //三级选项 字符串
						}, {
							"name": "绵竹市" //三级选项 字符串
						},
					]
				},{
					"name": "绵阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "涪城区" //三级选项 字符串
						}, {
							"name": "游仙区" //三级选项 字符串
						}, {
							"name": "三台县" //三级选项 字符串
						}, {
							"name": "盐亭县" //三级选项 字符串
						}, {
							"name": "安县" //三级选项 字符串
						}, {
							"name": "梓潼县" //三级选项 字符串
						}, {
							"name": "北川羌族自治县" //三级选项 字符串
						}, {
							"name": "平武县" //三级选项 字符串
						}, {
							"name": "江油市" //三级选项 字符串
						},
					]
				},{
					"name": "广元", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "市中区" //三级选项 字符串
						}, {
							"name": "元坝区" //三级选项 字符串
						}, {
							"name": "朝天区" //三级选项 字符串
						}, {
							"name": "旺苍县" //三级选项 字符串
						}, {
							"name": "青川县" //三级选项 字符串
						}, {
							"name": "剑阁县" //三级选项 字符串
						}, {
							"name": "苍溪县" //三级选项 字符串
						},
					]
				},{
					"name": "遂宁", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "船山区" //三级选项 字符串
						}, {
							"name": "安居区" //三级选项 字符串
						}, {
							"name": "蓬溪县" //三级选项 字符串
						}, {
							"name": "射洪县" //三级选项 字符串
						}, {
							"name": "大英县" //三级选项 字符串
						},
					]
				},{
					"name": "内江", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "市中区" //三级选项 字符串
						}, {
							"name": "东兴区" //三级选项 字符串
						}, {
							"name": "威远县" //三级选项 字符串
						}, {
							"name": "资中县" //三级选项 字符串
						}, {
							"name": "隆昌县" //三级选项 字符串
						},
					]
				},{
					"name": "乐山", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "市中区" //三级选项 字符串
						}, {
							"name": "沙湾区" //三级选项 字符串
						}, {
							"name": "五通桥区" //三级选项 字符串
						}, {
							"name": "金口河区" //三级选项 字符串
						}, {
							"name": "犍为县" //三级选项 字符串
						}, {
							"name": "井研县" //三级选项 字符串
						}, {
							"name": "夹江县" //三级选项 字符串
						}, {
							"name": "沐川县" //三级选项 字符串
						}, {
							"name": "峨边彝族自治县" //三级选项 字符串
						}, {
							"name": "马边彝族自治县" //三级选项 字符串
						}, {
							"name": "峨眉山市" //三级选项 字符串
						},
					]
				},{
					"name": "南充", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "顺庆区" //三级选项 字符串
						}, {
							"name": "高坪区" //三级选项 字符串
						}, {
							"name": "嘉陵区" //三级选项 字符串
						}, {
							"name": "南部县" //三级选项 字符串
						}, {
							"name": "营山县" //三级选项 字符串
						}, {
							"name": "蓬安县" //三级选项 字符串
						}, {
							"name": "仪陇县" //三级选项 字符串
						}, {
							"name": "西充县" //三级选项 字符串
						}, {
							"name": "阆中市" //三级选项 字符串
						},
					]
				},{
					"name": "眉山", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "东坡区" //三级选项 字符串
						}, {
							"name": "仁寿县" //三级选项 字符串
						}, {
							"name": "洪雅县" //三级选项 字符串
						}, {
							"name": "丹棱县" //三级选项 字符串
						}, {
							"name": "青神县" //三级选项 字符串
						},
					]
				},{
					"name": "宜宾", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "翠屏区" //三级选项 字符串
						}, {
							"name": "宜宾县" //三级选项 字符串
						}, {
							"name": "南溪县" //三级选项 字符串
						}, {
							"name": "江安县" //三级选项 字符串
						}, {
							"name": "长宁县" //三级选项 字符串
						}, {
							"name": "高县" //三级选项 字符串
						}, {
							"name": "珙县" //三级选项 字符串
						}, {
							"name": "筠连县" //三级选项 字符串
						}, {
							"name": "兴文县" //三级选项 字符串
						}, {
							"name": "屏山县" //三级选项 字符串
						},
					]
				},{
					"name": "广安", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "广安区" //三级选项 字符串
						}, {
							"name": "岳池县" //三级选项 字符串
						}, {
							"name": "武胜县" //三级选项 字符串
						}, {
							"name": "邻水县" //三级选项 字符串
						}, {
							"name": "华蓥市" //三级选项 字符串
						},
					]
				},{
					"name": "达州", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "通川区" //三级选项 字符串
						}, {
							"name": "达县" //三级选项 字符串
						}, {
							"name": "宣汉县" //三级选项 字符串
						}, {
							"name": "开江县" //三级选项 字符串
						}, {
							"name": "大竹县" //三级选项 字符串
						}, {
							"name": "渠县" //三级选项 字符串
						}, {
							"name": "万源市" //三级选项 字符串
						},
					]
				},{
					"name": "雅安", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "雨城区" //三级选项 字符串
						}, {
							"name": "名山县" //三级选项 字符串
						}, {
							"name": "荥经县" //三级选项 字符串
						}, {
							"name": "汉源县" //三级选项 字符串
						}, {
							"name": "石棉县" //三级选项 字符串
						}, {
							"name": "天全县" //三级选项 字符串
						}, {
							"name": "庐山县" //三级选项 字符串
						}, {
							"name": "宝兴县" //三级选项 字符串
						},
					]
				},{
					"name": "巴中", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "巴州区" //三级选项 字符串
						}, {
							"name": "通江县" //三级选项 字符串
						}, {
							"name": "南江县" //三级选项 字符串
						}, {
							"name": "平昌县" //三级选项 字符串
						},
					]
				},{
					"name": "资阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "雁江区" //三级选项 字符串
						}, {
							"name": "安岳县" //三级选项 字符串
						}, {
							"name": "乐至县" //三级选项 字符串
						}, {
							"name": "简阳市" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "阿坝", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "汶川县" //三级选项 字符串
						}, {
							"name": "理县" //三级选项 字符串
						}, {
							"name": "茂县" //三级选项 字符串
						}, {
							"name": "松潘县" //三级选项 字符串
						}, {
							"name": "九寨沟县" //三级选项 字符串
						}, {
							"name": "金川县" //三级选项 字符串
						}, {
							"name": "小金县" //三级选项 字符串
						}, {
							"name": "黑水县" //三级选项 字符串
						}, {
							"name": "马尔康县" //三级选项 字符串
						}, {
							"name": "壤塘县" //三级选项 字符串
						}, {
							"name": "阿坝县" //三级选项 字符串
						}, {
							"name": "诺尔盖县" //三级选项 字符串
						},{
							"name": "红原县" //三级选项 字符串
						},
					]
				},{
					"name": "甘孜", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "康定县" //三级选项 字符串
						}, {
							"name": "泸定县" //三级选项 字符串
						}, {
							"name": "丹巴县" //三级选项 字符串
						}, {
							"name": "九龙县" //三级选项 字符串
						}, {
							"name": "雅江县" //三级选项 字符串
						}, {
							"name": "道孚县" //三级选项 字符串
						}, {
							"name": "炉霍县" //三级选项 字符串
						}, {
							"name": "甘孜县" //三级选项 字符串
						}, {
							"name": "新龙县" //三级选项 字符串
						}, {
							"name": "德格县" //三级选项 字符串
						}, {
							"name": "白玉县" //三级选项 字符串
						}, {
							"name": "石渠县" //三级选项 字符串
						},{
							"name": "色达县" //三级选项 字符串
						},{
							"name": "理塘县" //三级选项 字符串
						},{
							"name": "巴塘县" //三级选项 字符串
						},{
							"name": "乡城县" //三级选项 字符串
						},{
							"name": "稻城县" //三级选项 字符串
						},{
							"name": "得荣县" //三级选项 字符串
						},
					]
				},{
					"name": "凉山", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "西昌市" //三级选项 字符串
						}, {
							"name": "木里藏族自治县" //三级选项 字符串
						}, {
							"name": "盐源县" //三级选项 字符串
						}, {
							"name": "德昌县" //三级选项 字符串
						}, {
							"name": "会理县" //三级选项 字符串
						}, {
							"name": "会东县" //三级选项 字符串
						}, {
							"name": "宁南县" //三级选项 字符串
						}, {
							"name": "普格县" //三级选项 字符串
						}, {
							"name": "布拖县" //三级选项 字符串
						}, {
							"name": "金阳县" //三级选项 字符串
						}, {
							"name": "昭觉县" //三级选项 字符串
						}, {
							"name": "喜德县" //三级选项 字符串
						},{
							"name": "冕宁县" //三级选项 字符串
						},{
							"name": "越西县" //三级选项 字符串
						},{
							"name": "甘洛县" //三级选项 字符串
						},{
							"name": "美姑县" //三级选项 字符串
						},{
							"name": "雷波县" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "贵州", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "贵阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "南明区" //三级选项 字符串
						}, {
							"name": "云岩区" //三级选项 字符串
						}, {
							"name": "花溪区" //三级选项 字符串
						}, {
							"name": "乌当区" //三级选项 字符串
						}, {
							"name": "白云区" //三级选项 字符串
						}, {
							"name": "小河区" //三级选项 字符串
						}, {
							"name": "开阳县" //三级选项 字符串
						}, {
							"name": "息烽县" //三级选项 字符串
						}, {
							"name": "修文县" //三级选项 字符串
						}, {
							"name": "清镇市" //三级选项 字符串
						},
					]
				},{
					"name": "六盘水", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "钟山区" //三级选项 字符串
						}, {
							"name": "六枝特区" //三级选项 字符串
						}, {
							"name": "水城县" //三级选项 字符串
						},
					]
				},{
					"name": "遵义", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "红花岗区" //三级选项 字符串
						}, {
							"name": "汇川区" //三级选项 字符串
						}, {
							"name": "遵义县" //三级选项 字符串
						}, {
							"name": "桐梓县" //三级选项 字符串
						}, {
							"name": "绥阳县" //三级选项 字符串
						}, {
							"name": "正安县" //三级选项 字符串
						}, {
							"name": "道真仡佬族苗族自治县" //三级选项 字符串
						}, {
							"name": "吴川仡佬族苗族自治县" //三级选项 字符串
						}, {
							"name": "凤冈县" //三级选项 字符串
						}, {
							"name": "湄潭县" //三级选项 字符串
						}, {
							"name": "余庆县" //三级选项 字符串
						}, {
							"name": "习水县" //三级选项 字符串
						},{
							"name": "赤水市" //三级选项 字符串
						},{
							"name": "仁怀市" //三级选项 字符串
						},
					]
				},{
					"name": "安顺", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "西秀区" //三级选项 字符串
						}, {
							"name": "平坝县" //三级选项 字符串
						}, {
							"name": "普定县" //三级选项 字符串
						}, {
							"name": "镇宁布依族苗族自治县" //三级选项 字符串
						}, {
							"name": "关岭布依族苗族自治县" //三级选项 字符串
						}, {
							"name": "紫云苗族布依族自治县" //三级选项 字符串
						},
					]
				},{
					"name": "铜仁", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "铜仁市" //三级选项 字符串
						}, {
							"name": "江口县" //三级选项 字符串
						}, {
							"name": "玉屏侗族自治县" //三级选项 字符串
						}, {
							"name": "石阡县" //三级选项 字符串
						}, {
							"name": "思南县" //三级选项 字符串
						}, {
							"name": "印江土家族苗族自治县" //三级选项 字符串
						}, {
							"name": "德江县" //三级选项 字符串
						}, {
							"name": "沿河土家族自治县" //三级选项 字符串
						}, {
							"name": "松桃苗族自治县" //三级选项 字符串
						}, {
							"name": "万山特区" //三级选项 字符串
						},
					]
				},{
					"name": "黔西南", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "兴义市" //三级选项 字符串
						}, {
							"name": "兴仁县" //三级选项 字符串
						}, {
							"name": "普安县" //三级选项 字符串
						}, {
							"name": "晴隆县" //三级选项 字符串
						}, {
							"name": "贞丰县" //三级选项 字符串
						}, {
							"name": "望谟县" //三级选项 字符串
						}, {
							"name": "册亨县" //三级选项 字符串
						}, {
							"name": "安龙县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "毕节", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "毕节市" //三级选项 字符串
						}, {
							"name": "大方县" //三级选项 字符串
						}, {
							"name": "黔西县" //三级选项 字符串
						}, {
							"name": "金沙县" //三级选项 字符串
						}, {
							"name": "织金县" //三级选项 字符串
						}, {
							"name": "纳雍县" //三级选项 字符串
						}, {
							"name": "威宁彝族回族苗族自治县" //三级选项 字符串
						}, {
							"name": "赫章县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "黔东南", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "凯里市" //三级选项 字符串
						}, {
							"name": "黄平县" //三级选项 字符串
						}, {
							"name": "施秉县" //三级选项 字符串
						}, {
							"name": "三穗县" //三级选项 字符串
						}, {
							"name": "镇原县" //三级选项 字符串
						}, {
							"name": "岑巩县" //三级选项 字符串
						}, {
							"name": "天柱县" //三级选项 字符串
						}, {
							"name": "锦屏县" //三级选项 字符串
						}, {
							"name": "剑河县" //三级选项 字符串
						}, {
							"name": "台江县" //三级选项 字符串
						}, {
							"name": "黎平县" //三级选项 字符串
						}, {
							"name": "榕江县" //三级选项 字符串
						}, {
							"name": "从江县" //三级选项 字符串
						}, {
							"name": "雷山县" //三级选项 字符串
						}, {
							"name": "麻江县" //三级选项 字符串
						}, {
							"name": "丹寨县" //三级选项 字符串
						},
					]
				},{
					"name": "黔南", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "都匀市" //三级选项 字符串
						}, {
							"name": "福泉市" //三级选项 字符串
						}, {
							"name": "荔波县" //三级选项 字符串
						}, {
							"name": "贵定县" //三级选项 字符串
						}, {
							"name": "瓮安县" //三级选项 字符串
						}, {
							"name": "独山县" //三级选项 字符串
						}, {
							"name": "平塘县" //三级选项 字符串
						}, {
							"name": "罗甸县" //三级选项 字符串
						}, {
							"name": "长顺县" //三级选项 字符串
						}, {
							"name": "龙里县" //三级选项 字符串
						}, {
							"name": "惠水县" //三级选项 字符串
						}, {
							"name": "三都水族自治县" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "云南省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "昆明", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "五华区" //三级选项 字符串
						}, {
							"name": "盘龙区" //三级选项 字符串
						}, {
							"name": "官渡区" //三级选项 字符串
						}, {
							"name": "西山区" //三级选项 字符串
						}, {
							"name": "东川区" //三级选项 字符串
						}, {
							"name": "呈贡县" //三级选项 字符串
						}, {
							"name": "普宁县" //三级选项 字符串
						}, {
							"name": "富民县" //三级选项 字符串
						}, {
							"name": "宜良县" //三级选项 字符串
						}, {
							"name": "石林彝族自治县" //三级选项 字符串
						}, {
							"name": "嵩明县" //三级选项 字符串
						}, {
							"name": "禄劝彝族苗族自治县" //三级选项 字符串
						}, {
							"name": "寻甸回族彝族自治县" //三级选项 字符串
						}, {
							"name": "安宁市" //三级选项 字符串
						},
					]
				},{
					"name": "曲靖", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "麒麟区" //三级选项 字符串
						}, {
							"name": "马龙县" //三级选项 字符串
						}, {
							"name": "陆良县" //三级选项 字符串
						}, {
							"name": "师宗县" //三级选项 字符串
						}, {
							"name": "罗平县" //三级选项 字符串
						}, {
							"name": "富源县" //三级选项 字符串
						}, {
							"name": "会泽县" //三级选项 字符串
						}, {
							"name": "沾益县" //三级选项 字符串
						}, {
							"name": "宣威市" //三级选项 字符串
						},
					]
				},{
					"name": "玉溪", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "红塔区" //三级选项 字符串
						}, {
							"name": "江川县" //三级选项 字符串
						}, {
							"name": "澄江县" //三级选项 字符串
						}, {
							"name": "通海县" //三级选项 字符串
						}, {
							"name": "华宁县" //三级选项 字符串
						}, {
							"name": "易门县" //三级选项 字符串
						}, {
							"name": "峨山彝族自治县" //三级选项 字符串
						}, {
							"name": "新平彝族傣族自治县" //三级选项 字符串
						}, {
							"name": "元江哈尼族彝族傣族自治县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "保山", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "隆阳区" //三级选项 字符串
						}, {
							"name": "施甸县" //三级选项 字符串
						}, {
							"name": "腾冲县" //三级选项 字符串
						}, {
							"name": "龙陵县" //三级选项 字符串
						}, {
							"name": "昌宁县" //三级选项 字符串
						},
					]
				},{
					"name": "昭通", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "昭阳区" //三级选项 字符串
						}, {
							"name": "鲁甸县" //三级选项 字符串
						}, {
							"name": "巧家县" //三级选项 字符串
						}, {
							"name": "盐津县" //三级选项 字符串
						}, {
							"name": "大关县" //三级选项 字符串
						}, {
							"name": "永善县" //三级选项 字符串
						}, {
							"name": "绥江县" //三级选项 字符串
						}, {
							"name": "镇雄县" //三级选项 字符串
						}, {
							"name": "彝良县" //三级选项 字符串
						}, {
							"name": "威信县" //三级选项 字符串
						}, {
							"name": "水富县" //三级选项 字符串
						},
					]
				},{
					"name": "丽江", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "古城区" //三级选项 字符串
						}, {
							"name": "玉龙纳西族自治县" //三级选项 字符串
						}, {
							"name": "永胜县" //三级选项 字符串
						}, {
							"name": "华坪县" //三级选项 字符串
						}, {
							"name": "宁蒗彝族自治县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "普洱", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "思茅区" //三级选项 字符串
						}, {
							"name": "宁洱哈尼族彝族自治县" //三级选项 字符串
						}, {
							"name": "墨江哈尼族自治县" //三级选项 字符串
						}, {
							"name": "景东彝族自治县" //三级选项 字符串
						}, {
							"name": "景谷傣族彝族自治县" //三级选项 字符串
						}, {
							"name": "镇沅彝族哈尼族拉祜族自治县" //三级选项 字符串
						}, {
							"name": "江城哈尼族自治县" //三级选项 字符串
						}, {
							"name": "孟连傣族拉祜族佤族自治县" //三级选项 字符串
						}, {
							"name": "澜沧拉祜族自治县" //三级选项 字符串
						}, {
							"name": "西盟佤族自治县" //三级选项 字符串
						},
					]
				},{
					"name": "临沧", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "临翔区" //三级选项 字符串
						}, {
							"name": "凤庆县" //三级选项 字符串
						}, {
							"name": "云县" //三级选项 字符串
						}, {
							"name": "永德县" //三级选项 字符串
						}, {
							"name": "镇康县" //三级选项 字符串
						}, {
							"name": "双江拉祜族佤族布朗族傣族自治县" //三级选项 字符串
						}, {
							"name": "耿马傣族佤族自治县" //三级选项 字符串
						}, {
							"name": "沧源佤族自治县" //三级选项 字符串
						},
					]
				},{
					"name": "楚雄", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "楚雄市" //三级选项 字符串
						}, {
							"name": "双柏县" //三级选项 字符串
						}, {
							"name": "牟定县" //三级选项 字符串
						}, {
							"name": "南华县" //三级选项 字符串
						}, {
							"name": "姚安县" //三级选项 字符串
						}, {
							"name": "大姚县" //三级选项 字符串
						}, {
							"name": "永仁县" //三级选项 字符串
						}, {
							"name": "元谋县" //三级选项 字符串
						}, {
							"name": "武定县" //三级选项 字符串
						}, {
							"name": "禄丰县" //三级选项 字符串
						},
					]
				},{
					"name": "红河", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "个旧市" //三级选项 字符串
						}, {
							"name": "开远市" //三级选项 字符串
						}, {
							"name": "蒙自县" //三级选项 字符串
						}, {
							"name": "屏边苗族自治县" //三级选项 字符串
						}, {
							"name": "建水县" //三级选项 字符串
						}, {
							"name": "石屏县" //三级选项 字符串
						}, {
							"name": "弥勒县" //三级选项 字符串
						}, {
							"name": "泸西县" //三级选项 字符串
						}, {
							"name": "元阳县" //三级选项 字符串
						}, {
							"name": "红河县" //三级选项 字符串
						}, {
							"name": "金平苗族瑶族傣族自治县" //三级选项 字符串
						}, {
							"name": "绿春县" //三级选项 字符串
						},	{
								"name": "河口瑶族自治县" //三级选项 字符串
							},
					]
				},{
					"name": "文山", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "文山县" //三级选项 字符串
						}, {
							"name": "砚山县" //三级选项 字符串
						}, {
							"name": "西畴县" //三级选项 字符串
						}, {
							"name": "麻栗坡县" //三级选项 字符串
						}, {
							"name": "马关县" //三级选项 字符串
						}, {
							"name": "丘北县" //三级选项 字符串
						}, {
							"name": "广南县" //三级选项 字符串
						}, {
							"name": "富宁县" //三级选项 字符串
						},
					]
				},{
					"name": "西双版纳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "景洪市" //三级选项 字符串
						}, {
							"name": "勐海县" //三级选项 字符串
						}, {
							"name": "勐腊县" //三级选项 字符串
						},
					]
				},{
					"name": "大理", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "大理市" //三级选项 字符串
						}, {
							"name": "漾濞彝族自治县" //三级选项 字符串
						}, {
							"name": "祥云县" //三级选项 字符串
						}, {
							"name": "宾川县" //三级选项 字符串
						}, {
							"name": "弥渡县" //三级选项 字符串
						}, {
							"name": "南涧彝族自治县" //三级选项 字符串
						}, {
							"name": "巍山彝族回族自治县" //三级选项 字符串
						}, {
							"name": "永平县" //三级选项 字符串
						}, {
							"name": "云龙县" //三级选项 字符串
						}, {
							"name": "洱源县" //三级选项 字符串
						}, {
							"name": "剑川县" //三级选项 字符串
						}, {
							"name": "鹤庆县" //三级选项 字符串
						},
					]
				},{
					"name": "德宏", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "瑞丽市" //三级选项 字符串
						}, {
							"name": "潞西市" //三级选项 字符串
						}, {
							"name": "梁河县" //三级选项 字符串
						}, {
							"name": "盈江县" //三级选项 字符串
						}, {
							"name": "陇川县" //三级选项 字符串
						},
					]
				},{
					"name": "怒江", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "泸水县" //三级选项 字符串
						}, {
							"name": "福贡县" //三级选项 字符串
						}, {
							"name": "贡山独龙族怒族自治县" //三级选项 字符串
						}, {
							"name": "兰坪白族普米族自治县" //三级选项 字符串
						},
					]
				},{
					"name": "迪庆", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "香格里拉县" //三级选项 字符串
						}, {
							"name": "德钦县" //三级选项 字符串
						}, {
							"name": "维西傈僳族自治县" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "陕西省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "西安", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "新城区" //三级选项 字符串
						}, {
							"name": "碑林区" //三级选项 字符串
						}, {
							"name": "莲湖区" //三级选项 字符串
						}, {
							"name": "灞桥区" //三级选项 字符串
						}, {
							"name": "未央区" //三级选项 字符串
						}, {
							"name": "雁塔区" //三级选项 字符串
						}, {
							"name": "阎良区" //三级选项 字符串
						}, {
							"name": "临潼区" //三级选项 字符串
						}, {
							"name": "长安区" //三级选项 字符串
						}, {
							"name": "蓝田县" //三级选项 字符串
						}, {
							"name": "周至县" //三级选项 字符串
						}, {
							"name": "户县" //三级选项 字符串
						},{
							"name": "高陵县" //三级选项 字符串
						},
					]
				},{
					"name": "铜川", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "王益区" //三级选项 字符串
						}, {
							"name": "印台区" //三级选项 字符串
						}, {
							"name": "耀州区" //三级选项 字符串
						}, {
							"name": "宜君县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "宝鸡", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "渭滨区" //三级选项 字符串
						}, {
							"name": "金台区" //三级选项 字符串
						}, {
							"name": "陈仓区" //三级选项 字符串
						}, {
							"name": "凤翔县" //三级选项 字符串
						}, {
							"name": "岐山县" //三级选项 字符串
						}, {
							"name": "扶风县" //三级选项 字符串
						}, {
							"name": "眉县" //三级选项 字符串
						}, {
							"name": "陇县" //三级选项 字符串
						}, {
							"name": "千阳县" //三级选项 字符串
						}, {
							"name": "麟游县" //三级选项 字符串
						}, {
							"name": "凤县" //三级选项 字符串
						}, {
							"name": "太白县" //三级选项 字符串
						},
					]
				},{
					"name": "咸阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "秦都区" //三级选项 字符串
						}, {
							"name": "杨凌区" //三级选项 字符串
						}, {
							"name": "渭城区" //三级选项 字符串
						}, {
							"name": "三原县" //三级选项 字符串
						}, {
							"name": "泾阳县" //三级选项 字符串
						}, {
							"name": "乾县" //三级选项 字符串
						}, {
							"name": "礼泉县" //三级选项 字符串
						}, {
							"name": "永寿县" //三级选项 字符串
						}, {
							"name": "彬县" //三级选项 字符串
						}, {
							"name": "长武县" //三级选项 字符串
						}, {
							"name": "旬邑县" //三级选项 字符串
						}, {
							"name": "淳化县" //三级选项 字符串
						},{
							"name": "武功县" //三级选项 字符串
						},{
							"name": "兴平市" //三级选项 字符串
						},
					]
				},{
					"name": "渭南", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "临渭区" //三级选项 字符串
						}, {
							"name": "华县" //三级选项 字符串
						}, {
							"name": "潼关县" //三级选项 字符串
						}, {
							"name": "大荔县" //三级选项 字符串
						}, {
							"name": "合阳县" //三级选项 字符串
						}, {
							"name": "澄城县" //三级选项 字符串
						}, {
							"name": "蒲城县" //三级选项 字符串
						}, {
							"name": "白水县" //三级选项 字符串
						}, {
							"name": "富平县" //三级选项 字符串
						}, {
							"name": "韩城市" //三级选项 字符串
						}, {
							"name": "华阴市" //三级选项 字符串
						},
					]
				},{
					"name": "延安", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "宝塔区" //三级选项 字符串
						}, {
							"name": "延长县" //三级选项 字符串
						}, {
							"name": "延川县" //三级选项 字符串
						}, {
							"name": "子长县" //三级选项 字符串
						}, {
							"name": "安塞县" //三级选项 字符串
						}, {
							"name": "志丹县" //三级选项 字符串
						}, {
							"name": "吴起县" //三级选项 字符串
						}, {
							"name": "甘泉县" //三级选项 字符串
						}, {
							"name": "富县" //三级选项 字符串
						}, {
							"name": "洛川县" //三级选项 字符串
						}, {
							"name": "宜川县" //三级选项 字符串
						}, {
							"name": "黄龙县" //三级选项 字符串
						},{
							"name": "黄陵县" //三级选项 字符串
						},
					]
				},{
					"name": "汉中", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "汉台区" //三级选项 字符串
						}, {
							"name": "南郑县" //三级选项 字符串
						}, {
							"name": "城固县" //三级选项 字符串
						}, {
							"name": "洋县" //三级选项 字符串
						}, {
							"name": "西乡县" //三级选项 字符串
						}, {
							"name": "勉县" //三级选项 字符串
						}, {
							"name": "宁强县" //三级选项 字符串
						}, {
							"name": "略阳县" //三级选项 字符串
						}, {
							"name": "镇巴县" //三级选项 字符串
						}, {
							"name": "留坝县" //三级选项 字符串
						}, {
							"name": "佛坪县" //三级选项 字符串
						},
					]
				},{
					"name": "榆林", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "榆阳区" //三级选项 字符串
						}, {
							"name": "神木县" //三级选项 字符串
						}, {
							"name": "府谷县" //三级选项 字符串
						}, {
							"name": "横山县" //三级选项 字符串
						}, {
							"name": "靖边县" //三级选项 字符串
						}, {
							"name": "定边县" //三级选项 字符串
						}, {
							"name": "绥德县" //三级选项 字符串
						}, {
							"name": "米脂县" //三级选项 字符串
						}, {
							"name": "佳县" //三级选项 字符串
						}, {
							"name": "吴堡县" //三级选项 字符串
						}, {
							"name": "清涧县" //三级选项 字符串
						}, {
							"name": "子洲县" //三级选项 字符串
						},
					]
				},{
					"name": "安康", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "汉滨区" //三级选项 字符串
						}, {
							"name": "汉阴县" //三级选项 字符串
						}, {
							"name": "石泉县" //三级选项 字符串
						}, {
							"name": "宁陕县" //三级选项 字符串
						}, {
							"name": "紫阳县" //三级选项 字符串
						}, {
							"name": "岚皋县" //三级选项 字符串
						}, {
							"name": "平利县" //三级选项 字符串
						}, {
							"name": "镇坪县" //三级选项 字符串
						}, {
							"name": "旬阳县" //三级选项 字符串
						}, {
							"name": "白河县" //三级选项 字符串
						},
					]
				},{
					"name": "商洛", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "商州区" //三级选项 字符串
						}, {
							"name": "洛南县" //三级选项 字符串
						}, {
							"name": "丹凤县" //三级选项 字符串
						}, {
							"name": "商南县" //三级选项 字符串
						}, {
							"name": "山阳县" //三级选项 字符串
						}, {
							"name": "镇安县" //三级选项 字符串
						}, {
							"name": "柞水县" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "甘肃省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "兰州市", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "城关区" //三级选项 字符串
						}, {
							"name": "七里河区" //三级选项 字符串
						}, {
							"name": "西固区" //三级选项 字符串
						}, {
							"name": "安宁区" //三级选项 字符串
						}, {
							"name": "红古区" //三级选项 字符串
						}, {
							"name": "永登县" //三级选项 字符串
						}, {
							"name": "皋兰县" //三级选项 字符串
						}, {
							"name": "榆中县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "嘉峪关", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "嘉峪关市" //三级选项 字符串
						},
					]
				},{
					"name": "金昌", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "金川区" //三级选项 字符串
						}, {
							"name": "永昌县" //三级选项 字符串
						},
					]
				},{
					"name": "白银", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "白银区" //三级选项 字符串
						}, {
							"name": "平川区" //三级选项 字符串
						}, {
							"name": "靖远县" //三级选项 字符串
						}, {
							"name": "会宁县" //三级选项 字符串
						}, {
							"name": "景泰县" //三级选项 字符串
						},
					]
				},{
					"name": "天水", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "秦州区" //三级选项 字符串
						}, {
							"name": "麦积区" //三级选项 字符串
						}, {
							"name": "清水县" //三级选项 字符串
						}, {
							"name": "秦安县" //三级选项 字符串
						}, {
							"name": "甘谷县" //三级选项 字符串
						}, {
							"name": "武山县" //三级选项 字符串
						}, {
							"name": "张家川回族自治县" //三级选项 字符串
						},
					]
				},{
					"name": "武威", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "凉州区" //三级选项 字符串
						}, {
							"name": "民勤县" //三级选项 字符串
						}, {
							"name": "古浪县" //三级选项 字符串
						}, {
							"name": "天祝藏族自治县" //三级选项 字符串
						},
					]
				},{
					"name": "张掖", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "甘州区" //三级选项 字符串
						}, {
							"name": "肃南裕固族自治县" //三级选项 字符串
						}, {
							"name": "民乐县" //三级选项 字符串
						}, {
							"name": "临泽县" //三级选项 字符串
						}, {
							"name": "高台县" //三级选项 字符串
						}, {
							"name": "山丹县" //三级选项 字符串
						},
					]
				},{
					"name": "平凉", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "崆峒区" //三级选项 字符串
						}, {
							"name": "泾川县" //三级选项 字符串
						}, {
							"name": "灵台县" //三级选项 字符串
						}, {
							"name": "崇信县" //三级选项 字符串
						}, {
							"name": "华亭县" //三级选项 字符串
						}, {
							"name": "庄浪县" //三级选项 字符串
						}, {
							"name": "静宁县" //三级选项 字符串
						},
					]
				},{
					"name": "酒泉", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "肃州区" //三级选项 字符串
						}, {
							"name": "金塔县" //三级选项 字符串
						}, {
							"name": "瓜州县" //三级选项 字符串
						}, {
							"name": "肃北蒙古族自治县" //三级选项 字符串
						}, {
							"name": "阿克塞哈萨克族自治县" //三级选项 字符串
						}, {
							"name": "玉门市" //三级选项 字符串
						}, {
							"name": "敦煌市" //三级选项 字符串
						},
					]
				},{
					"name": "庆阳", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "西峰区" //三级选项 字符串
						}, {
							"name": "庆城县" //三级选项 字符串
						}, {
							"name": "环县" //三级选项 字符串
						}, {
							"name": "华池县" //三级选项 字符串
						}, {
							"name": "合水县" //三级选项 字符串
						}, {
							"name": "正宁县" //三级选项 字符串
						}, {
							"name": "宁县" //三级选项 字符串
						}, {
							"name": "镇原县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "定西", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "安定区" //三级选项 字符串
						}, {
							"name": "通渭县" //三级选项 字符串
						}, {
							"name": "陇西县" //三级选项 字符串
						}, {
							"name": "渭源县" //三级选项 字符串
						}, {
							"name": "临洮县" //三级选项 字符串
						}, {
							"name": "漳县" //三级选项 字符串
						}, {
							"name": "岷县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "陇南", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "武都区" //三级选项 字符串
						}, {
							"name": "成县" //三级选项 字符串
						}, {
							"name": "文县" //三级选项 字符串
						}, {
							"name": "宕昌县" //三级选项 字符串
						}, {
							"name": "康县" //三级选项 字符串
						}, {
							"name": "西和县" //三级选项 字符串
						}, {
							"name": "礼县" //三级选项 字符串
						}, {
							"name": "徽县" //三级选项 字符串
						}, {
							"name": "两当县" //三级选项 字符串
						},
					]
				},{
					"name": "临夏", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "临夏市" //三级选项 字符串
						}, {
							"name": "临夏县" //三级选项 字符串
						}, {
							"name": "康乐县" //三级选项 字符串
						}, {
							"name": "永靖县" //三级选项 字符串
						}, {
							"name": "广河县" //三级选项 字符串
						}, {
							"name": "和政县" //三级选项 字符串
						}, {
							"name": "东乡族自治县" //三级选项 字符串
						}, {
							"name": "积石山保安族东乡族撒拉族自治县" //三级选项 字符串
						},
					]
				},{
					"name": "甘南", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "合作市" //三级选项 字符串
						}, {
							"name": "临潭县" //三级选项 字符串
						}, {
							"name": "卓尼县" //三级选项 字符串
						}, {
							"name": "舟曲县" //三级选项 字符串
						}, {
							"name": "迭部县" //三级选项 字符串
						}, {
							"name": "玛曲县" //三级选项 字符串
						}, {
							"name": "碌曲县" //三级选项 字符串
						}, {
							"name": "夏河县" //三级选项 字符串
						},
					]
				}
			]
		}, {
			"name": "青海省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "西宁", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "城东区" //三级选项 字符串
						}, {
							"name": "城中区" //三级选项 字符串
						}, {
							"name": "城西区" //三级选项 字符串
						}, {
							"name": "城北区" //三级选项 字符串
						}, {
							"name": "大通回族土族自治县" //三级选项 字符串
						}, {
							"name": "湟中县" //三级选项 字符串
						}, {
							"name": "湟源县" //三级选项 字符串
						},
					]
				},{
					"name": "海东", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "平安县" //三级选项 字符串
						}, {
							"name": "民和回族土族自治县" //三级选项 字符串
						}, {
							"name": "乐都县" //三级选项 字符串
						}, {
							"name": "互助土族自治县" //三级选项 字符串
						}, {
							"name": "化隆回族自治县" //三级选项 字符串
						}, {
							"name": "循化撒拉族自治县" //三级选项 字符串
						},
					]
				},{
					"name": "海北", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "门源回族自治县" //三级选项 字符串
						}, {
							"name": "祁连县" //三级选项 字符串
						}, {
							"name": "海晏县" //三级选项 字符串
						}, {
							"name": "刚察县" //三级选项 字符串
						},
					]
				},{
					"name": "黄南", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "同仁县" //三级选项 字符串
						}, {
							"name": "尖扎县" //三级选项 字符串
						}, {
							"name": "泽库县" //三级选项 字符串
						}, {
							"name": "河南蒙古族自治县" //三级选项 字符串
						},
					]
				},{
					"name": "海南", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "共和县" //三级选项 字符串
						}, {
							"name": "同德县贵德县" //三级选项 字符串
						}, {
							"name": "兴海县" //三级选项 字符串
						}, {
							"name": "贵南县" //三级选项 字符串
						},
					]
				},{
					"name": "果洛", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "玛沁县" //三级选项 字符串
						}, {
							"name": "班唛县" //三级选项 字符串
						}, {
							"name": "甘德县" //三级选项 字符串
						}, {
							"name": "达日县" //三级选项 字符串
						}, {
							"name": "久治县" //三级选项 字符串
						}, {
							"name": "玛多县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "玉树", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "玉树县" //三级选项 字符串
						}, {
							"name": "杂多县" //三级选项 字符串
						}, {
							"name": "称多县" //三级选项 字符串
						}, {
							"name": "治多县" //三级选项 字符串
						}, {
							"name": "囊谦县" //三级选项 字符串
						}, {
							"name": "曲麻莱县" //三级选项 字符串
						},
					]
				},{
					"name": "海西", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "格尔木市" //三级选项 字符串
						}, {
							"name": "德令哈市" //三级选项 字符串
						}, {
							"name": "乌兰县" //三级选项 字符串
						}, {
							"name": "都兰县" //三级选项 字符串
						}, {
							"name": "天峻县" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "台湾省", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "台北市", //二级选项 字符串
				},{
					"name": "高雄市", //二级选项 字符串
				},{
					"name": "基隆市", //二级选项 字符串
				},{
					"name": "台中市", //二级选项 字符串
				},{
					"name": "台南市", //二级选项 字符串
				},{
					"name": "新竹市", //二级选项 字符串
				},{
					"name": "嘉义市", //二级选项 字符串
				},{
					"name": "台北县", //二级选项 字符串
				},{
					"name": "宜兰县", //二级选项 字符串
				},{
					"name": "桃园县", //二级选项 字符串
				},{
					"name": "新竹县", //二级选项 字符串
				},{
					"name": "苗栗县", //二级选项 字符串
				},{
					"name": "台中县", //二级选项 字符串
				},{
					"name": "彰化县", //二级选项 字符串
				},{
					"name": "南投县", //二级选项 字符串
				},{
					"name": "云林县", //二级选项 字符串
				},{
					"name": "嘉义县", //二级选项 字符串
				},{
					"name": "台南县", //二级选项 字符串
				},{
					"name": "高雄县", //二级选项 字符串
				},{
					"name": "屏东县", //二级选项 字符串
				},{
					"name": "台东县", //二级选项 字符串
				},{
					"name": "花莲县", //二级选项 字符串
				},{
					"name": "澎湖县", //二级选项 字符串
				},
			]
		}, {
			"name": "内蒙古", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "呼和浩特", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "新城区" //三级选项 字符串
						}, {
							"name": "回民区" //三级选项 字符串
						}, {
							"name": "玉泉区" //三级选项 字符串
						}, {
							"name": "赛罕区" //三级选项 字符串
						}, {
							"name": "土默特左旗" //三级选项 字符串
						}, {
							"name": "托克托县" //三级选项 字符串
						}, {
							"name": "和林格尔县" //三级选项 字符串
						}, {
							"name": "清水河县" //三级选项 字符串
						}, {
							"name": "武川县" //三级选项 字符串
						},
					]
				},	{
						"name": "包头", //二级选项 字符串
						"sub": [ //JSON数组
							{
								"name": "东河区" //三级选项 字符串
							}, {
								"name": "昆都仑区" //三级选项 字符串
							}, {
								"name": "青山区" //三级选项 字符串
							}, {
								"name": "石拐区" //三级选项 字符串
							}, {
								"name": "白云鄂博矿区" //三级选项 字符串
							}, {
								"name": "九原区" //三级选项 字符串
							}, {
								"name": "土默特右旗" //三级选项 字符串
							}, {
								"name": "固阳县" //三级选项 字符串
							}, {
								"name": "达尔罕茂明安联合旗" //三级选项 字符串
							},
						]
					},	{
							"name": "乌海", //二级选项 字符串
							"sub": [ //JSON数组
								{
									"name": "海勃湾区" //三级选项 字符串
								}, {
									"name": "海南区" //三级选项 字符串
								}, {
									"name": "乌达区" //三级选项 字符串
								},
							]
						},	{
								"name": "赤峰", //二级选项 字符串
								"sub": [ //JSON数组
									{
										"name": "红山区" //三级选项 字符串
									}, {
										"name": "元宝山区" //三级选项 字符串
									}, {
										"name": "松山区" //三级选项 字符串
									}, {
										"name": "阿鲁科尔沁旗" //三级选项 字符串
									}, {
										"name": "巴林左旗" //三级选项 字符串
									}, {
										"name": "巴林右旗" //三级选项 字符串
									}, {
										"name": "林西县" //三级选项 字符串
									}, {
										"name": "克什克腾旗" //三级选项 字符串
									}, {
										"name": "翁牛特旗" //三级选项 字符串
									}, {
										"name": "喀喇沁旗" //三级选项 字符串
									}, {
										"name": "宁城县" //三级选项 字符串
									}, {
										"name": "敖汉旗" //三级选项 字符串
									},
								]
							},	{
									"name": "通辽", //二级选项 字符串
									"sub": [ //JSON数组
										{
											"name": "科尔沁区" //三级选项 字符串
										}, {
											"name": "科尔沁左翼中旗" //三级选项 字符串
										}, {
											"name": "科尔沁左翼后旗" //三级选项 字符串
										}, {
											"name": "开鲁县" //三级选项 字符串
										}, {
											"name": "库伦旗" //三级选项 字符串
										}, {
											"name": "奈曼旗" //三级选项 字符串
										}, {
											"name": "扎鲁特旗" //三级选项 字符串
										}, {
											"name": "霍林郭勒市" //三级选项 字符串
										},
									]
								},	{
										"name": "鄂尔多斯", //二级选项 字符串
										"sub": [ //JSON数组
											{
												"name": "东胜区" //三级选项 字符串
											}, {
												"name": "达拉特旗" //三级选项 字符串
											}, {
												"name": "准格尔旗" //三级选项 字符串
											}, {
												"name": "鄂托克前旗" //三级选项 字符串
											}, {
												"name": "杭锦旗" //三级选项 字符串
											}, {
												"name": "乌审旗" //三级选项 字符串
											}, {
												"name": "伊金霍洛旗" //三级选项 字符串
											},
										]
									},	{
											"name": "呼伦贝尔", //二级选项 字符串
											"sub": [ //JSON数组
												{
													"name": "海拉尔区" //三级选项 字符串
												}, {
													"name": "阿荣旗" //三级选项 字符串
												}, {
													"name": "莫力达瓦达斡尔族自治旗" //三级选项 字符串
												}, {
													"name": "鄂伦春自治旗" //三级选项 字符串
												}, {
													"name": "鄂温克族自治旗" //三级选项 字符串
												}, {
													"name": "陈巴尔虎旗" //三级选项 字符串
												}, {
													"name": "新巴尔虎左旗" //三级选项 字符串
												}, {
													"name": "新巴尔虎右旗" //三级选项 字符串
												}, {
													"name": "满洲里市" //三级选项 字符串
												}, {
													"name": "牙克石市" //三级选项 字符串
												}, {
													"name": "扎兰屯市" //三级选项 字符串
												}, {
													"name": "额尔古纳市" //三级选项 字符串
												},{
													"name": "根河市" //三级选项 字符串
												},
											]
										},	{
												"name": "巴彦淖尔", //二级选项 字符串
												"sub": [ //JSON数组
													{
														"name": "临河区" //三级选项 字符串
													}, {
														"name": "五原县" //三级选项 字符串
													}, {
														"name": "磴口县" //三级选项 字符串
													}, {
														"name": "乌拉特前旗" //三级选项 字符串
													}, {
														"name": "乌拉特中旗" //三级选项 字符串
													}, {
														"name": "乌拉特后旗" //三级选项 字符串
													}, {
														"name": "杭锦后旗" //三级选项 字符串
													}, {
														"name": "" //三级选项 字符串
													},
												]
											},	{
													"name": "乌兰察布", //二级选项 字符串
													"sub": [ //JSON数组
														{
															"name": "集宁区" //三级选项 字符串
														}, {
															"name": "卓资县" //三级选项 字符串
														}, {
															"name": "化德县" //三级选项 字符串
														}, {
															"name": "商都县" //三级选项 字符串
														}, {
															"name": "兴和县" //三级选项 字符串
														}, {
															"name": "凉城县" //三级选项 字符串
														}, {
															"name": "察哈尔右翼前旗" //三级选项 字符串
														}, {
															"name": "察哈尔右翼中旗" //三级选项 字符串
														}, {
															"name": "察哈尔右翼后旗" //三级选项 字符串
														}, {
															"name": "四王子其" //三级选项 字符串
														}, {
															"name": "丰镇市" //三级选项 字符串
														},
													]
												},{
														"name": "兴安", //二级选项 字符串
														"sub": [ //JSON数组
															{
																"name": "乌兰浩特市" //三级选项 字符串
															}, {
																"name": "阿尔山市" //三级选项 字符串
															}, {
																"name": "科尔沁右翼前旗" //三级选项 字符串
															}, {
																"name": "科尔沁右翼中旗" //三级选项 字符串
															}, {
																"name": "扎赉特旗" //三级选项 字符串
															}, {
																"name": "突泉县" //三级选项 字符串
															},
														]
													},{
															"name": "锡林郭勒", //二级选项 字符串
															"sub": [ //JSON数组
																{
																	"name": "二连浩特市" //三级选项 字符串
																}, {
																	"name": "锡林浩特市" //三级选项 字符串
																}, {
																	"name": "阿巴嘎旗" //三级选项 字符串
																}, {
																	"name": "苏尼特左旗" //三级选项 字符串
																}, {
																	"name": "苏尼特右旗" //三级选项 字符串
																}, {
																	"name": "东乌珠穆沁旗" //三级选项 字符串
																}, {
																	"name": "西乌珠穆沁旗" //三级选项 字符串
																}, {
																	"name": "太仆寺旗" //三级选项 字符串
																}, {
																	"name": "镶黄旗" //三级选项 字符串
																}, {
																	"name": "正镶白旗" //三级选项 字符串
																}, {
																	"name": "正蓝旗" //三级选项 字符串
																}, {
																	"name": "多伦县" //三级选项 字符串
																},
															]
														},{
																"name": "阿拉善", //二级选项 字符串
																"sub": [ //JSON数组
																	{
																		"name": "阿拉善左旗" //三级选项 字符串
																	}, {
																		"name": "阿拉善右旗" //三级选项 字符串
																	}, {
																		"name": "额济纳旗" //三级选项 字符串
																	},
																]
															},
			]
		}, {
			"name": "西藏", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "拉萨", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "城关区" //三级选项 字符串
						}, {
							"name": "林周县" //三级选项 字符串
						}, {
							"name": "当雄县" //三级选项 字符串
						}, {
							"name": "尼木县" //三级选项 字符串
						}, {
							"name": "曲水县" //三级选项 字符串
						}, {
							"name": "堆龙德庆下" //三级选项 字符串
						}, {
							"name": "达孜县" //三级选项 字符串
						}, {
							"name": "墨竹工卡县" //三级选项 字符串
						},
					]
				},{
					"name": "昌都", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "昌都县" //三级选项 字符串
						}, {
							"name": "江达县" //三级选项 字符串
						}, {
							"name": "贡觉县" //三级选项 字符串
						}, {
							"name": "类乌齐县" //三级选项 字符串
						}, {
							"name": "丁青县" //三级选项 字符串
						}, {
							"name": "察雅县" //三级选项 字符串
						}, {
							"name": "八宿县" //三级选项 字符串
						}, {
							"name": "左贡县" //三级选项 字符串
						}, {
							"name": "芒康县" //三级选项 字符串
						}, {
							"name": "洛隆县" //三级选项 字符串
						}, {
							"name": "边坝县" //三级选项 字符串
						},
					]
				},{
					"name": "山南", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "乃东县" //三级选项 字符串
						}, {
							"name": "扎囊县" //三级选项 字符串
						}, {
							"name": "贡嘎县" //三级选项 字符串
						}, {
							"name": "桑日县" //三级选项 字符串
						}, {
							"name": "琼结县" //三级选项 字符串
						}, {
							"name": "曲松县" //三级选项 字符串
						}, {
							"name": "措美县" //三级选项 字符串
						}, {
							"name": "洛扎县" //三级选项 字符串
						}, {
							"name": "加查县" //三级选项 字符串
						}, {
							"name": "隆子县" //三级选项 字符串
						}, {
							"name": "错那县" //三级选项 字符串
						}, {
							"name": "浪卡子县" //三级选项 字符串
						},
					]
				},{
					"name": "日喀则", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "日喀则市" //三级选项 字符串
						}, {
							"name": "南木林县" //三级选项 字符串
						}, {
							"name": "江孜县" //三级选项 字符串
						}, {
							"name": "定日县" //三级选项 字符串
						}, {
							"name": "萨迦县" //三级选项 字符串
						}, {
							"name": "拉孜县" //三级选项 字符串
						}, {
							"name": "昂仁县" //三级选项 字符串
						}, {
							"name": "谢通门县" //三级选项 字符串
						}, {
							"name": "白朗县" //三级选项 字符串
						}, {
							"name": "仁布县" //三级选项 字符串
						}, {
							"name": "康马县" //三级选项 字符串
						}, {
							"name": "定结县" //三级选项 字符串
						}, {
							"name": "仲巴县" //三级选项 字符串
						}, {
							"name": "亚东县" //三级选项 字符串
						}, {
							"name": "吉隆县" //三级选项 字符串
						}, {
							"name": "聂拉木县" //三级选项 字符串
						}, {
							"name": "萨嘎县" //三级选项 字符串
						}, {
							"name": "岗巴县" //三级选项 字符串
						},
					]
				},{
					"name": "那曲", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "那曲县" //三级选项 字符串
						}, {
							"name": "嘉黎县" //三级选项 字符串
						}, {
							"name": "比如县" //三级选项 字符串
						}, {
							"name": "聂荣县" //三级选项 字符串
						}, {
							"name": "安多县" //三级选项 字符串
						}, {
							"name": "申扎县" //三级选项 字符串
						}, {
							"name": "索县" //三级选项 字符串
						}, {
							"name": "班戈县" //三级选项 字符串
						}, {
							"name": "巴青县" //三级选项 字符串
						}, {
							"name": "尼玛县" //三级选项 字符串
						},
					]
				},{
					"name": "阿里", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "普兰县" //三级选项 字符串
						}, {
							"name": "札达县" //三级选项 字符串
						}, {
							"name": "噶尔县" //三级选项 字符串
						}, {
							"name": "日土县" //三级选项 字符串
						}, {
							"name": "革吉县" //三级选项 字符串
						}, {
							"name": "改则县" //三级选项 字符串
						}, {
							"name": "措勤县" //三级选项 字符串
						},
					]
				},{
					"name": "林芝", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "林芝县" //三级选项 字符串
						}, {
							"name": "工布江达县" //三级选项 字符串
						}, {
							"name": "米林县" //三级选项 字符串
						}, {
							"name": "墨脱县" //三级选项 字符串
						}, {
							"name": "波密县" //三级选项 字符串
						}, {
							"name": "察隅县" //三级选项 字符串
						}, {
							"name": "朗县" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "宁夏", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "银川", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "兴庆区" //三级选项 字符串
						}, {
							"name": "西夏区" //三级选项 字符串
						}, {
							"name": "金凤区" //三级选项 字符串
						}, {
							"name": "永宁县" //三级选项 字符串
						}, {
							"name": "贺兰县" //三级选项 字符串
						}, {
							"name": "灵武市" //三级选项 字符串
						},
					]
				},{
					"name": "石嘴山", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "大武口区" //三级选项 字符串
						}, {
							"name": "惠农区" //三级选项 字符串
						}, {
							"name": "平罗县" //三级选项 字符串
						},
					]
				},{
					"name": "吴忠", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "利通区" //三级选项 字符串
						}, {
							"name": "红寺堡区" //三级选项 字符串
						}, {
							"name": "盐池县" //三级选项 字符串
						}, {
							"name": "同心县" //三级选项 字符串
						}, {
							"name": "青铜峡市" //三级选项 字符串
						},
					]
				},{
					"name": "固原", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "原州区" //三级选项 字符串
						}, {
							"name": "西吉县" //三级选项 字符串
						}, {
							"name": "隆德县" //三级选项 字符串
						}, {
							"name": "泾源县" //三级选项 字符串
						}, {
							"name": "彭阳县" //三级选项 字符串
						},
					]
				},{
					"name": "中卫", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "沙坡头区" //三级选项 字符串
						}, {
							"name": "中宁县" //三级选项 字符串
						}, {
							"name": "海原县" //三级选项 字符串
						},
					]
				},
			]
		}, {
			"name": "新疆", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "乌鲁木齐", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "天山区" //三级选项 字符串
						}, {
							"name": "沙依巴克区" //三级选项 字符串
						}, {
							"name": "新市区" //三级选项 字符串
						}, {
							"name": "水磨沟区" //三级选项 字符串
						}, {
							"name": "头屯河区" //三级选项 字符串
						}, {
							"name": "达坂城区" //三级选项 字符串
						}, {
							"name": "米东区" //三级选项 字符串
						}, {
							"name": "乌鲁木齐县" //三级选项 字符串
						},
					]
				},{
					"name": "卡拉玛依", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "独山子区" //三级选项 字符串
						}, {
							"name": "克拉玛依区" //三级选项 字符串
						}, {
							"name": "白碱滩区" //三级选项 字符串
						}, {
							"name": "乌尔禾区" //三级选项 字符串
						},
					]
				},{
					"name": "吐鲁番", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "吐鲁番市" //三级选项 字符串
						}, {
							"name": "鄯善县" //三级选项 字符串
						}, {
							"name": "托克逊县" //三级选项 字符串
						}, {
							"name": "" //三级选项 字符串
						},
					]
				},{
					"name": "哈密", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "哈密市" //三级选项 字符串
						}, {
							"name": "巴里坤哈萨克自治县" //三级选项 字符串
						}, {
							"name": "伊吾县" //三级选项 字符串
						},
					]
				},{
					"name": "昌吉", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "昌吉市" //三级选项 字符串
						}, {
							"name": "阜康市" //三级选项 字符串
						}, {
							"name": "呼图壁县" //三级选项 字符串
						}, {
							"name": "玛纳斯县" //三级选项 字符串
						}, {
							"name": "奇台县" //三级选项 字符串
						}, {
							"name": "吉木萨尔县" //三级选项 字符串
						}, {
							"name": "木垒哈萨克自治县" //三级选项 字符串
						},
					]
				},{
					"name": "博尔塔拉", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "博乐市" //三级选项 字符串
						}, {
							"name": "精河县" //三级选项 字符串
						}, {
							"name": "温泉县" //三级选项 字符串
						},
					]
				},{
					"name": "巴音郭楞", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "库尔勒市" //三级选项 字符串
						}, {
							"name": "轮台县" //三级选项 字符串
						}, {
							"name": "尉犁县" //三级选项 字符串
						}, {
							"name": "若羌县" //三级选项 字符串
						}, {
							"name": "且末县" //三级选项 字符串
						}, {
							"name": "焉耆回族自治县" //三级选项 字符串
						}, {
							"name": "和静县" //三级选项 字符串
						}, {
							"name": "和硕县" //三级选项 字符串
						}, {
							"name": "博湖县" //三级选项 字符串
						},
					]
				},{
					"name": "阿克苏", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "阿克苏市" //三级选项 字符串
						}, {
							"name": "温宿县" //三级选项 字符串
						}, {
							"name": "库车县" //三级选项 字符串
						}, {
							"name": "沙雅县" //三级选项 字符串
						}, {
							"name": "新和县" //三级选项 字符串
						}, {
							"name": "拜城县" //三级选项 字符串
						}, {
							"name": "乌什县" //三级选项 字符串
						}, {
							"name": "阿瓦提县" //三级选项 字符串
						}, {
							"name": "柯坪县" //三级选项 字符串
						},
					]
				},{
					"name": "克孜勒苏", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "阿图什市" //三级选项 字符串
						}, {
							"name": "阿克陶县" //三级选项 字符串
						}, {
							"name": "阿合奇县" //三级选项 字符串
						}, {
							"name": "乌恰县" //三级选项 字符串
						},
					]
				},{
					"name": "喀什", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "喀什市" //三级选项 字符串
						}, {
							"name": "疏附县" //三级选项 字符串
						}, {
							"name": "疏勒县" //三级选项 字符串
						}, {
							"name": "英吉沙县" //三级选项 字符串
						}, {
							"name": "泽普县" //三级选项 字符串
						}, {
							"name": "莎车县" //三级选项 字符串
						}, {
							"name": "叶城县" //三级选项 字符串
						}, {
							"name": "麦盖提县" //三级选项 字符串
						}, {
							"name": "岳普湖县" //三级选项 字符串
						}, {
							"name": "伽师县" //三级选项 字符串
						}, {
							"name": "巴楚县" //三级选项 字符串
						}, {
							"name": "塔什库尔干塔吉克自治县" //三级选项 字符串
						},
					]
				},{
					"name": "和田", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "和田市" //三级选项 字符串
						}, {
							"name": "和田县" //三级选项 字符串
						}, {
							"name": "墨玉县" //三级选项 字符串
						}, {
							"name": "皮山县" //三级选项 字符串
						}, {
							"name": "洛浦县" //三级选项 字符串
						}, {
							"name": "策勒县" //三级选项 字符串
						}, {
							"name": "于田县" //三级选项 字符串
						}, {
							"name": "民丰县" //三级选项 字符串
						},
					]
				},{
					"name": "伊犁", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "伊宁市" //三级选项 字符串
						}, {
							"name": "奎屯市" //三级选项 字符串
						}, {
							"name": "伊宁县" //三级选项 字符串
						}, {
							"name": "察布查尔锡伯自治县" //三级选项 字符串
						}, {
							"name": "霍城县" //三级选项 字符串
						}, {
							"name": "巩留县" //三级选项 字符串
						}, {
							"name": "新源县" //三级选项 字符串
						}, {
							"name": "昭苏县" //三级选项 字符串
						}, {
							"name": "特克斯县" //三级选项 字符串
						}, {
							"name": "尼勒克县" //三级选项 字符串
						},
					]
				},{
					"name": "塔城", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "塔城市" //三级选项 字符串
						}, {
							"name": "乌苏市" //三级选项 字符串
						}, {
							"name": "额敏县" //三级选项 字符串
						}, {
							"name": "沙湾县" //三级选项 字符串
						}, {
							"name": "托里县" //三级选项 字符串
						}, {
							"name": "裕民县" //三级选项 字符串
						}, {
							"name": "和布克赛尔蒙古自治县" //三级选项 字符串
						},
					]
				},{
					"name": "阿勒泰", //二级选项 字符串
					"sub": [ //JSON数组
						{
							"name": "阿勒泰市" //三级选项 字符串
						}, {
							"name": "布尔津县" //三级选项 字符串
						}, {
							"name": "富蕴县" //三级选项 字符串
						}, {
							"name": "福海县" //三级选项 字符串
						}, {
							"name": "哈巴河县" //三级选项 字符串
						}, {
							"name": "清河县" //三级选项 字符串
						}, {
							"name": "吉木乃县" //三级选项 字符串
						},
					]
				},{
					"name": "石河子", //二级选项 字符串
				},{
					"name": "阿拉尔", //二级选项 字符串
				},{
					"name": "图木舒克", //二级选项 字符串
				},{
					"name": "五家渠", //二级选项 字符串
				},{
					"name": "北屯", //二级选项 字符串
				},
			]
		}, {
			"name": "香港", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "中西区", //二级选项 字符串
				},{
					"name": "东区", //二级选项 字符串
				},{
					"name": "九龙城区", //二级选项 字符串
				},{
					"name": "观塘区", //二级选项 字符串
				},{
					"name": "南区", //二级选项 字符串
				},{
					"name": "深水埗区", //二级选项 字符串
				},{
					"name": "湾仔区", //二级选项 字符串
				},{
					"name": "油尖旺区", //二级选项 字符串
				},{
					"name": "离岛区", //二级选项 字符串
				},{
					"name": "葵青区", //二级选项 字符串
				},{
					"name": "北区", //二级选项 字符串
				},{
					"name": "西贡区", //二级选项 字符串
				},{
					"name": "沙田区", //二级选项 字符串
				},{
					"name": "屯门区", //二级选项 字符串
				},{
					"name": "大埔区", //二级选项 字符串
				},{
					"name": "荃湾区", //二级选项 字符串
				},{
					"name": "元朗区", //二级选项 字符串
				},
			]
		}, {
			"name": "澳门", //一级选项 字符串
			"sub": [ //JSON数组
				{
					"name": "花地玛堂区", //二级选项 字符串
				},{
					"name": "圣安多尼堂区", //二级选项 字符串
				},{
					"name": "大堂区", //二级选项 字符串
				},{
					"name": "望德堂区", //二级选项 字符串
				},{
					"name": "风顺堂区", //二级选项 字符串
				},{
					"name": "氹仔", //二级选项 字符串
				},{
					"name": "路环", //二级选项 字符串
				},
			]
		}
	];
